{"version": "https://jsonfeed.org/version/1", "title": "Apuntes de eduardófilo", "home_page_url": "https://apuntes.eduardofilo.es/", "feed_url": "https://apuntes.eduardofilo.es/feed.json", "description": "Apuntes varios sobre algunas de las cosas que necesito recordar, principalmente sobre Desarrollo y Sistemas.", "icon": null, "authors": [{"name": "Eduardo Moreno Lamana"}], "language": "es", "items": [{"id": "https://apuntes.eduardofilo.es/2024-09-09_zx_mechtrum.html", "url": "https://apuntes.eduardofilo.es/2024-09-09_zx_mechtrum.html", "title": "ZX Mechtrum", "content_html": "<p><img alt=\"Mechtrum\" src=\"images/posts/2024-09-09_zx_mechtrum/mechtrum_logo.png\" /></p>\n<p>Hace tiempo que me apetecía montar un kit de <a href=\"https://www.bytedelight.com/?product=harlequin-128k-rev-2d-black-large-diy-kit\">ZX Spectrum Harlequin 128</a>. Es el Spectrum perfecto (128KB, soporte de todos los modelos/ROMs de las distintas versiones producidas por Sinclair y Amstrad, y con componentes que se pueden adquirir a día de hoy, incluida la ULA que está reemplazada por lógica discreta). Pero para la caja, la opción de adquirir una de las carcasas réplica del 48K original (gomas), no me entusiasmaba.</p>\n<p>Hace unos meses conocí el proyecto <a href=\"https://leesmithsworkshop.co.uk/products/the-mechtrum-mechanical-keyboard-zx-spectrum-case\">ZX Mechtrum</a> de Lee Smith, una caja para placas de formato 48KB con un teclado mecánico, y me pareció el complemento perfecto para el Harlequin. De hecho, en el <a href=\"https://www.youtube.com/watch?v=Gr8KhQHaJr4\">vídeo del canal More Fun Making It</a> gracias al que supe de su existencia, su creador comenta que tiene el proyecto inmediato de instalar un Harlequin 128 en una de estas cajas.</p>\n<p>Como ya existen varios vídeos y guías tanto del <a href=\"https://www.youtube.com/watch?v=s1klr5vRye0\">kit Harlequin</a> como de la caja <a href=\"https://www.youtube.com/watch?v=O_FdXpOi2W4\">ZX Mechtrum</a>, no voy a detallar el proceso de montaje, pero sí describirlo en general y comentar algunas particularidades y problemas que he encontrado.</p>\n<h4 id=\"mechtrum\">Mechtrum<a class=\"headerlink\" href=\"#mechtrum\" title=\"Permanent link\">&para;</a></h4>\n<p>Como el kit Harlequin 128 es distribuido por Byte Delight, por lo que su disponibilidad es bastante estable, el punto más crítico del plan era adquirir el <a href=\"https://leesmithsworkshop.co.uk/products/the-mechtrum-mechanical-keyboard-zx-spectrum-case\">Mechtrum de Lee Smith</a>, ya que la venta de productos no es su principal actividad. De hecho pude conseguir la última unidad de una tirada que hizo a finales de 2023. En el momento de escribir esto (septiembre 2024) vuelve a estar a la venta, pero no es de esperar que se mantenga siempre así. El caso es que pude adquirir una unidad que llegó ya montada. Mi unidad venía con 3 faceplates, una para el 48K, otra para el <a href=\"https://github.com/UzixLS/zx-sizif-512/\">Sifzif 512</a> y otra para el Harlequin 128.</p>\n<p><img alt=\"Mechtrum\" src=\"images/posts/2024-09-09_zx_mechtrum/mechtrum.jpg\" /></p>\n<h4 id=\"harlequin-128\">Harlequin 128<a class=\"headerlink\" href=\"#harlequin-128\" title=\"Permanent link\">&para;</a></h4>\n<p>El Harlequin 128, es un diseño de Don Superfo y puede adquirirse la PCB a través de los enlaces que hay en el <a href=\"https://github.com/DonSuperfo/Superfo-Harlequin-128\">repositorio base del proyecto</a>. En el repositorio se encuentra también la BOM (Bill Of Materials) para las distintas versiones con todos los componentes necesarios. Pero con diferencia la opción más sencilla es adquirir uno de los kits que distribuye Ben Versteeg, de <a href=\"https://www.bytedelight.com/\">Byte Delight</a>. El kit viene con una PCB de la versión issue 2D y todos los componentes necesarios para montarlo, convenientemente clasificados en bolsitas junto a un manual con el que es casi imposible perderse. También hay épocas en las que no está disponible en su tienda, pero es cuestión de estar atento o suscribirse a las notificaciones de disponibilidad. En mi caso tuve que esperar un par de meses a que volviera a estar disponible.</p>\n<p><img alt=\"Harlequin 128\" src=\"images/posts/2024-09-09_zx_mechtrum/harlequin_128.jpg\" /></p>\n<p>El único problema que tuve durante su montaje fue que según el manual el array de resistencias R61 es opcional si no se va a instalar la interfaz de joystick. Pero esas resistencias, además de dar servicio al puerto de joystick, hacen de pullup para los microinterruptores de selección del banco de ROM, por lo que sin instalarlas, la selección de bancos de ROM superiores al 0 no era estable. Tras instalar el array R61, todo funcionó correctamente.</p>\n<p><img alt=\"Harlequin 128 ROM selector pullups\" src=\"images/posts/2024-09-09_zx_mechtrum/harlequin_128_pullups.png\" /></p>\n<h4 id=\"resultado\">Resultado<a class=\"headerlink\" href=\"#resultado\" title=\"Permanent link\">&para;</a></h4>\n<p>El resultado es un sueño hecho realidad, un Spectrum 128K con teclado mecánico y componentes fiables. Además de una belleza. 🤩</p>\n<p><img alt=\"Mechtrum\" src=\"images/posts/2024-09-09_zx_mechtrum/resultado.jpg\" /></p>", "image": "https://apuntes.eduardofilo.es/images/posts/2024-09-09_zx_mechtrum/mechtrum_logo.png", "date_published": "2024-09-09T12:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/en/2024-09-09_zx_mechtrum.html", "url": "https://apuntes.eduardofilo.es/en/2024-09-09_zx_mechtrum.html", "title": "ZX Mechtrum", "content_html": "<p><img alt=\"Mechtrum\" src=\"../images/posts/2024-09-09_zx_mechtrum/mechtrum_logo.png\" /></p>\n<p>For a while, I’ve wanted to assemble a <a href=\"https://www.bytedelight.com/?product=harlequin-128k-rev-2d-black-large-diy-kit\">ZX Spectrum Harlequin 128</a> kit. It’s the perfect Spectrum (128KB, supports all models/ROMs from the various versions produced by Sinclair and Amstrad, and with components that can still be acquired today, including the ULA, which has been replaced by discrete logic). However, the option of purchasing a replica case of the original 48K (rubber keys) didn’t really excite me.</p>\n<p>A few months ago, I came across Lee Smith’s <a href=\"https://leesmithsworkshop.co.uk/products/the-mechtrum-mechanical-keyboard-zx-spectrum-case\">ZX Mechtrum</a> project, a case for 48KB-format boards with a mechanical keyboard, and it seemed like the perfect complement for the Harlequin. In fact, in the <a href=\"https://www.youtube.com/watch?v=Gr8KhQHaJr4\">video from the More Fun Making It channel</a>, through which I learned of its existence, its creator mentions that he plans to install a Harlequin 128 in one of these cases soon.</p>\n<p>Since there are already several videos and guides for both the <a href=\"https://www.youtube.com/watch?v=s1klr5vRye0\">Harlequin kit</a> and the <a href=\"https://www.youtube.com/watch?v=O_FdXpOi2W4\">ZX Mechtrum</a> case, I won’t detail the assembly process but will instead describe it generally and mention some peculiarities and problems I encountered.</p>\n<h4 id=\"mechtrum\">Mechtrum<a class=\"headerlink\" href=\"#mechtrum\" title=\"Permanent link\">&para;</a></h4>\n<p>Since the Harlequin 128 kit is distributed by Byte Delight, its availability is quite stable, so the most critical point of the plan was acquiring the <a href=\"https://leesmithsworkshop.co.uk/products/the-mechtrum-mechanical-keyboard-zx-spectrum-case\">Mechtrum from Lee Smith</a>, as selling products is not his main activity. In fact, I managed to get the last unit from a batch he made in late 2023. As of writing this (September 2024), it’s back on sale, but it’s not expected to remain available for long. In any case, I was able to acquire a unit that arrived pre-assembled. My unit came with 3 faceplates, one for the 48K, another for the <a href=\"https://github.com/UzixLS/zx-sizif-512/\">Sifzif 512</a>, and one for the Harlequin 128.</p>\n<p><img alt=\"Mechtrum\" src=\"../images/posts/2024-09-09_zx_mechtrum/mechtrum.jpg\" /></p>\n<h4 id=\"harlequin-128\">Harlequin 128<a class=\"headerlink\" href=\"#harlequin-128\" title=\"Permanent link\">&para;</a></h4>\n<p>The Harlequin 128 is a design by Don Superfo, and the PCB can be purchased through the links provided in the <a href=\"https://github.com/DonSuperfo/Superfo-Harlequin-128\">project’s base repository</a>. The repository also contains the BOM (Bill Of Materials) for the different versions with all the necessary components. However, by far the easiest option is to purchase one of the kits distributed by Ben Versteeg from <a href=\"https://www.bytedelight.com/\">Byte Delight</a>. The kit comes with an issue 2D version PCB and all the necessary components to assemble it, conveniently sorted into bags along with a manual that makes it almost impossible to get lost. There are times when it’s not available in his store, but it’s just a matter of staying alert or subscribing to availability notifications. In my case, I had to wait a couple of months for it to become available again.</p>\n<p><img alt=\"Harlequin 128\" src=\"../images/posts/2024-09-09_zx_mechtrum/harlequin_128.jpg\" /></p>\n<p>The only problem I encountered during assembly was that, according to the manual, the R61 resistor array is optional if you’re not going to install the joystick interface. However, these resistors, in addition to serving the joystick port, also act as pullups for the ROM bank selection microswitches, so without them, selecting ROM banks higher than 0 was unstable. After installing the R61 array, everything worked correctly.</p>\n<p><img alt=\"Harlequin 128 ROM selector pullups\" src=\"../images/posts/2024-09-09_zx_mechtrum/harlequin_128_pullups.png\" /></p>\n<h4 id=\"resultado\">Resultado<a class=\"headerlink\" href=\"#resultado\" title=\"Permanent link\">&para;</a></h4>\n<p>The result is a dream come true: a 128K Spectrum with a mechanical keyboard and reliable components. And it’s a beauty. 🤩</p>\n<p><img alt=\"Mechtrum\" src=\"../images/posts/2024-09-09_zx_mechtrum/resultado.jpg\" /></p>", "image": "https://apuntes.eduardofilo.es/images/posts/2024-09-09_zx_mechtrum/mechtrum_logo.png", "date_published": "2024-09-09T12:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/2024-09-04_steam_deck_arch.html", "url": "https://apuntes.eduardofilo.es/2024-09-04_steam_deck_arch.html", "title": "Instalación Arch Linux en Steam Deck", "content_html": "<p><img alt=\"Steam Deck con Arch Linux\" src=\"images/posts/2024-09-04_steam_deck_arch/steam_deck_logo.png\" /></p>\n<div class=\"admonition info\">\n<p class=\"admonition-title\">Pérdida de dual boot al actualizar SteamOS</p>\n<p>En la actualización de SteamOS a la rama 3.6 (en concreto la primera versión estable de esa rama fue la 3.6.19) se perdió la configuración del dualboot por lo que la máquina sólo arrancaba en SteamOS. La solución fue volver a seguir los pasos de <a href=\"#instalacion-gestor-dualboot\">Instalación gestor dualboot</a> a partir del paso 4.</p>\n</div>\n<p>En julio de 2024 durante unas semanas, el modelo de 512GB de la Steam Deck LCD pudo adquirirse por debajo de los 400€. Un precio muy atractivo para una <a href=\"https://www.steamdeck.com/es/tech/deck\">máquina decente</a> con procesador AMD de arquitectura x86 (AMD64), 16GB de RAM, disco SSD tipo NVMe de la capacidad mencionada antes, pantalla táctil y controles de juego integrados. Es decir un PC consolizado, pero un PC al fin y al cabo. Pero sobre todo lo que hace para mi especialmente atractiva la máquina es su soporte Linux completo, lo que la convierte en una plataforma ideal para cacharrear con distribuciones Linux o utilizarlo como PC portátil secundario. Todo esto naturalmente además de su uso convencional para jugar y <a href=\"https://www.emudeck.com/\">emular</a> videojuegos.</p>\n<p>SteamOS, el sistema operativo que trae de serie, está basado en Arch Linux, y en su modo escritorio, puede utilizarse prácticamente como un Arch Linux normal. La principal restricción es que está construido en modo inmutable y a pesar de que este tipo de configuración de sistema tiene sus virtudes y se entiende perfectamente que Valve lo haya escogido para su máquina, todavía prefiero un sistema normal (mutable), por lo que me decidí por instalar un Arch normal y aprender a instalar de paso esta distribución. Según el <a href=\"https://wiki.archlinux.org/title/Steam_Deck\">wiki de Arch</a>, el hardware del modelo LCD de la Steam Deck está soportado al 100% en Arch.</p>\n<p>Lo que sigue es el procedimiento completo que he utilizado.</p>\n<h2 id=\"tecladoraton\">Teclado/ratón<a class=\"headerlink\" href=\"#tecladoraton\" title=\"Permanent link\">&para;</a></h2>\n<p>Aunque gran parte de las operaciones pueden hacerse utilizando la pantalla táctil y los trackpads de la Steam Deck, es muy recomendable conectar un teclado y ratón a la consola para facilitar la instalación, sobre todo durante la sesión de terminal con la que instalaremos el sistema base. La Steam Deck sólo posee un puerto USB-C, por lo que lo más práctico es utilizar un dock. También puede ser suficiente (sobre todo si ejecutamos los sistemas live desde una microSD) con un dongle de teclado/ratón inalámbricos conectados con un adaptador USB&lt;-&gt;USB-C, aunque en ese caso conviene asegurarse de que la Steam Deck tiene la batería completamente cargada.</p>\n<p>En mi caso utilicé un dock <a href=\"https://www.dell.com/es-es/shop/adaptador-multipuerto-usb-c-de-dell-7-en-1-da310/apd/470-aeup/conexi%C3%B3n-wifi-y-redes\">DA310z</a> de Dell.</p>\n<h2 id=\"reparticionado-del-disco\">Reparticionado del disco<a class=\"headerlink\" href=\"#reparticionado-del-disco\" title=\"Permanent link\">&para;</a></h2>\n<p>El disco SSD de la Steam Deck que adquirí es de 512GB y de tipo NVMe. Es el tamaño mínimo si queremos instalar otro sistema junto a SteamOS.</p>\n<p>Antes de empezar con la instalación debemos hacer hueco para la misma encogiendo la partición principal (la número 8). Para ello podemos utilizar prácticamente cualquier distribución live Linux que arranquemos desde una unidad extraíble (USB o microSD) ya que todas ellas llevan algún programa para gestionar particiones. En mi caso utilicé una ISO del programa <code>gparted</code>.</p>\n<p>El procedimiento completo puede verse a continuación:</p>\n<ol>\n<li>Descargar la <a href=\"https://gparted.org/download.php\">ISO de gparted</a>. En concreto en mi caso utilicé <a href=\"https://downloads.sourceforge.net/gparted/gparted-live-1.6.0-3-amd64.iso\">ésta versión</a>.</li>\n<li>Instalar la ISO en un pendrive o mejor aún en una microSD (ya que la Steam Deck posee una ranura para éstas). Puede utilizarse un programa como <a href=\"https://www.balena.io/etcher/\">Balena Etcher</a> o el comando <code>dd</code> de Linux si se <a href=\"sistemas/raspi.html#backup-de-la-sd-comprimiendo-al-vuelo\">sabe manejar</a>.</li>\n<li>Arrancar la Steam Deck con el pendrive o la microSD insertada manteniendo pulsado el botón de bajar el volumen hasta que se escuchen los tonos de encendido. Esto hace que la consola arranque en el menú <code>Boot Manager</code>.</li>\n<li>Seleccionar la opción de arrancar desde el dispositivo extraíble que aparecerá en el menú como <code>EFI USB Device (USB)</code> o <code>EFI SD/MMC Card (XX XXXX XXXX)</code> según si utilizamos un pendrive o una microSD respectivamente.</li>\n<li>\n<p>Aparece una pantalla de configuración  en la que hacemos las siguientes selecciones:</p>\n<ul>\n<li>Policy for handling keymaps =&gt; Don't touch keymap</li>\n<li>Which language do you prefer? =&gt; 25</li>\n<li>Which mode do you prefer? =&gt; 0</li>\n</ul>\n</li>\n<li>\n<p>Tras aceptar la última opción anterior, arrancará el programa <code>gparted</code> en modo gráfico (con la pantalla girada, eso sí). Haremos cambios hasta dejar las particiones como se ve en la foto. Básicamente lo que haremos será encoger la partición #8 unos 100GB, crear la #9 de 4GB para swap y la #10 con el espacio restante para el sistema raíz de Arch:</p>\n<p><img alt=\"Particiones de la Steam Deck\" src=\"images/posts/2024-09-04_steam_deck_arch/steam-deck-partitions.png\" /></p>\n</li>\n</ol>\n<p>Destacar a la vista de las particiones que utiliza SteamOS que hace uso de un <a href=\"https://blog.davidbyrne.dev/2018/08/16/linux-ab-partitions\">sistema de particiones A/B</a>, habitual en Android, por el cual la mayoría de las particiones del sistema (excepto la de usuario) están duplicadas. Dicho sistema está pensado para facilitar las actualizaciones, o más bien para volver atrás en caso de problemas durante las mismas.</p>\n<h2 id=\"instalacion-base\">Instalación base<a class=\"headerlink\" href=\"#instalacion-base\" title=\"Permanent link\">&para;</a></h2>\n<p>Para el proceso de instalación del sistema base me decanté por el camino convencional siguiendo las instrucciones de la <a href=\"https://wiki.archlinux.org/title/Installation_guide\">guía de instalación</a> en el wiki de Arch. Dicha instalación utiliza una ISO de un sistema Arch que podremos arrancar desde una unidad extraíble (USB o microSD) con el que instalaremos los paquetes básicos para tener un sistema arrancable y muy básico.</p>\n<p>Antes de comenzar, comentar que por las características tan dinámicas de la distribución Arch Linux, es muy posible que esta guía quede desactualizada en poco tiempo. Por lo que recomiendo consultar la <a href=\"https://wiki.archlinux.org/title/Installation_guide\">guía oficial</a> en caso de encontrar que algo no sale como se supone.</p>\n<p>A continuación vemos paso a paso el proceso de instalación:</p>\n<ol>\n<li>Descargar la <a href=\"https://archlinux.org/download/\">ISO de Arch Linux</a>. En concreto en mi caso utilicé <a href=\"https://es.mirrors.cicku.me/archlinux/iso/2024.08.01/archlinux-2024.08.01-x86_64.iso\">ésta versión</a>.</li>\n<li>Instalar la ISO en un pendrive o mejor aún en una microSD para utilizar la ranura que posee la Steam Deck. Puede utilizarse un programa como <a href=\"https://www.balena.io/etcher/\">Balena Etcher</a> o el comando <code>dd</code> de Linux si se <a href=\"sistemas/raspi.html#backup-de-la-sd-comprimiendo-al-vuelo\">sabe manejar</a>.</li>\n<li>Arrancar la Steam Deck con el pendrive o la microSD insertada manteniendo pulsado el botón de bajar el volumen hasta que se escuchen los tonos de encendido. Esto hace que la consola arranque en el menú <code>Boot Manager</code>.</li>\n<li>Seleccionar la opción de arrancar desde el dispositivo extraíble que aparecerá en el menú como <code>EFI USB Device (USB)</code> o <code>EFI SD/MMC Card (XX XXXX XXXX)</code> según si utilizamos un pendrive o una microSD respectivamente.</li>\n<li>\n<p>Una vez que termine de arrancar el sistema live de instalación de Arch, ejecutar los siguiente comandos en orden (en la sesión con <code>iwctl</code> sustituiremos <code>&lt;SSID&gt;</code> por el nuestro e introduciremos la contraseña cuando se nos pida; también sustituiremos el identificador de usuario <code>&lt;USER&gt;</code> por el que queramos utilizar):</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># loadkeys es</span>\n<span class=\"c1\"># iwctl</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># station wlan0 scan</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># station wlan0 get-networks</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># station wlan0 connect &lt;SSID&gt;</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># exit</span>\n<span class=\"c1\"># mkfs.ext4 /dev/nvme0n1p10</span>\n<span class=\"c1\"># mkswap /dev/nvme0n1p9</span>\n<span class=\"c1\"># mount /dev/nvme0n1p10 /mnt</span>\n<span class=\"c1\"># mount --mkdir /dev/nvme0n1p1 /mnt/boot/efi</span>\n<span class=\"c1\"># swapon /dev/nvme0n1p9</span>\n<span class=\"c1\"># pacstrap -K /mnt base base-devel linux linux-firmware sudo vi ntfs-3g networkmanager amd-ucode grub efibootmgr git cmake qt5-wayland</span>\n<span class=\"c1\"># genfstab -U /mnt &gt;&gt; /mnt/etc/fstab</span>\n<span class=\"c1\"># arch-chroot /mnt</span>\n<span class=\"c1\"># ln -sf /usr/share/zoneinfo/Europe/Madrid /etc/localtime</span>\n<span class=\"c1\"># hwclock --systohc</span>\n<span class=\"c1\"># vi /etc/locale.gen    # descomentar &#39;en_US.UTF-8 UTF-8&#39; y &#39;es_ES.UTF-8 UTF-8&#39;</span>\n<span class=\"c1\"># locale-gen</span>\n<span class=\"c1\"># echo &quot;LANG=es_ES.UTF-8&quot; &gt; /etc/locale.conf</span>\n<span class=\"c1\"># echo &quot;KEYMAP=es&quot; &gt; /etc/vconsole.conf</span>\n<span class=\"c1\"># echo &quot;deck&quot; &gt; /etc/hostname</span>\n<span class=\"c1\"># echo -e &quot;\\n127.0.0.1    localhost\\n::1    localhost\\n127.0.1.1    deck&quot; &gt;&gt; /etc/hosts</span>\n<span class=\"c1\"># passwd</span>\n<span class=\"c1\"># grub-install --target=x86_64-efi --efi-directory=/boot/efi --bootloader-id=Arch</span>\n<span class=\"c1\"># grub-mkconfig -o /boot/grub/grub.cfg</span>\n<span class=\"c1\"># systemctl enable NetworkManager</span>\n<span class=\"c1\"># useradd -m -G wheel,audio,video,storage &lt;USER&gt;</span>\n<span class=\"c1\"># passwd &lt;USER&gt;</span>\n<span class=\"c1\"># chmod u+w /etc/sudoers</span>\n<span class=\"c1\"># vi /etc/sudoers       # Descomentar &#39;%wheel ALL=(ALL) ALL&#39;</span>\n<span class=\"c1\"># chmod u-w /etc/sudoers</span>\n<span class=\"c1\"># pacman -Syy</span>\n<span class=\"c1\"># pacman -S xorg-server xf86-video-amdgpu maliit-keyboard qt5-wayland</span>\n<span class=\"c1\"># su - &lt;USER&gt;</span>\n</code></pre></div>\n</li>\n</ol>\n<p>El password que elegiremos cuando ejecutemos el comando <code>passwd &lt;USER&gt;</code> debe ser numérico si queremos utilizar Plasma Mobile, ya que la pantalla de desbloqueo sólo nos permite introducir un PIN.</p>\n<h2 id=\"instalacion-entorno-grafico\">Instalación entorno gráfico<a class=\"headerlink\" href=\"#instalacion-entorno-grafico\" title=\"Permanent link\">&para;</a></h2>\n<p>Continuamos donde nos habíamos quedado, es decir en la sesión chroot desde el sistema live de instalación de Arch Linux. Lo haremos ya con el usuario normal (no root) por lo que a partir de ahora haremos uso con frecuencia de <code>sudo</code>.</p>\n<p>Ahora vamos a instalar los entornos gráficos. Lo digo en plural porque vamos a instalar dos, Plasma y Plasma Mobile. Hago esto porque dependiendo de si vamos a utilizar la Steam Deck con Arch en modo escritorio (con teclado/ratón y posiblemente pantalla) o portátil (sin teclado/ratón), nos convendrá más un sistema u otro, dado que Plasma Mobile presenta un interfaz diseñado para ser manejado con una pantalla táctil (estilo tablet).</p>\n<p>En realidad no es necesario instalar los dos escritorios, por eso se han separado sus pasos de instalación. Podemos instalar uno, el otro o ambos.</p>\n<h4 id=\"plasma\">Plasma<a class=\"headerlink\" href=\"#plasma\" title=\"Permanent link\">&para;</a></h4>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>plasma-meta\n</code></pre></div>\n<p>Durante la instalación del paquete anterior se nos harán una serie de preguntas. A la tercera pregunta responder <code>2) noto-fonts</code>. En el resto ofrecer la respuesta predeterminada (pulsando retorno).</p>\n<h4 id=\"plasma-mobile\">Plasma Mobile<a class=\"headerlink\" href=\"#plasma-mobile\" title=\"Permanent link\">&para;</a></h4>\n<p>Plasma Mobile no se encuentra todavía en los repositorios oficiales. Tenemos que utilizar <a href=\"https://aur.archlinux.org/\">AUR</a>:</p>\n<ol>\n<li>\n<p>Empezamos instalando algunas dependencias:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>plasma-workspace<span class=\"w\"> </span>kcontacts<span class=\"w\"> </span>kirigami2<span class=\"w\"> </span>kpeople<span class=\"w\"> </span>libphonenumber\n</code></pre></div>\n</li>\n<li>\n<p>Instalamos los paquetes de AUR <code>plasma-nano</code>, <code>plasma-settings</code> y <code>plasma-mobile</code> en este orden:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>~\n$<span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://aur.archlinux.org/plasma-nano.git\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>plasma-nano\n$<span class=\"w\"> </span>makepkg<span class=\"w\"> </span>-si\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>~\n$<span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://aur.archlinux.org/plasma-settings.git\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>plasma-settings\n$<span class=\"w\"> </span>makepkg<span class=\"w\"> </span>-si\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>~\n$<span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://aur.archlinux.org/plasma-mobile.git\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>plasma-mobile\n$<span class=\"w\"> </span>makepkg<span class=\"w\"> </span>-si\n</code></pre></div>\n</li>\n</ol>\n<h4 id=\"fin-de-instalacion-entorno-grafico\">Fin de instalación entorno gráfico<a class=\"headerlink\" href=\"#fin-de-instalacion-entorno-grafico\" title=\"Permanent link\">&para;</a></h4>\n<ol>\n<li>\n<p>Instalamos el gestor de sesiones SDDM y algunas aplicaciones que nos harán falta para terminar la instalación desde el modo gráfico:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>sddm<span class=\"w\"> </span>konsole<span class=\"w\"> </span>dolphin<span class=\"w\"> </span>kwrite<span class=\"w\"> </span>partitionmanager<span class=\"w\"> </span>power-profiles-daemon\n$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>systemctl<span class=\"w\"> </span><span class=\"nb\">enable</span><span class=\"w\"> </span>sddm\n$<span class=\"w\"> </span><span class=\"nb\">exit</span>\n</code></pre></div>\n</li>\n<li>\n<p>Cerramos la sesión chroot, desmontamos las particiones y reiniciamos el sistema:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># exit</span>\n<span class=\"c1\"># umount -R /mnt</span>\n<span class=\"c1\"># reboot</span>\n</code></pre></div>\n</li>\n</ol>\n<h2 id=\"configuracion-basica\">Configuración básica<a class=\"headerlink\" href=\"#configuracion-basica\" title=\"Permanent link\">&para;</a></h2>\n<p>Tras reiniciar deberíamos ver el gestor de sesiones SDDM, inicialmente con la pantalla girada y sin posibilidad de utilizar el teclado en pantalla, por lo que todavía continuaremos utilizando el teclado y ratón externos.</p>\n<p>Una vez que hayamos iniciado sesión en Plasma o Plasma Mobile, lo primero que tenemos que hacer es configurar la conexión a internet. Para ello hacemos click sobre el icono correspondiente en la bandeja del sistema abajo a la derecha en Plasma o arriba a la derecha en Plasma Mobile.</p>\n<p>Una vez que tengamos conexión, abrimos la aplicación Konsole y ejecutamos los siguientes comandos para instalar el paquete de aplicaciones básico de KDE, el navegador Firefox y el servidor SSH:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>firefox<span class=\"w\"> </span>kde-applications-meta<span class=\"w\"> </span>openssh<span class=\"w\"> </span>usbutils<span class=\"w\"> </span>lshw<span class=\"w\"> </span>man-db<span class=\"w\"> </span>htop<span class=\"w\"> </span>spectacle\n$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>systemctl<span class=\"w\"> </span>start<span class=\"w\"> </span>sshd\n$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>systemctl<span class=\"w\"> </span><span class=\"nb\">enable</span><span class=\"w\"> </span>sshd\n</code></pre></div>\n<p>Finalmente hacemos las siguientes configuraciones:</p>\n<ul>\n<li><code>Preferencias &gt; Preferencias del sistema &gt; Entrada y salida &gt; Pantalla y monitor &gt; Escalar</code>: Configurar la escala de la pantalla a 110%.</li>\n<li><code>Preferencias &gt; Preferencias del sistema &gt; Entrada y salida &gt; Teclado &gt; Distribuciones &gt; Configurar distribuciones &gt; Añadir</code>: Añadir la distribución de teclado español.</li>\n<li><code>Preferencias &gt; Preferencias del sistema &gt; Entrada y salida &gt; Teclado &gt; Teclado virtual</code>: Seleccionar <code>Maliit</code>.</li>\n<li><code>Preferencias &gt; Preferencias del sistema &gt; Idioma y hora &gt; Fecha y hora &gt; Zona horaria</code>: Seleccionar Madrid.</li>\n<li><code>Preferencias &gt; Preferencias del sistema &gt; Aspecto y estilo &gt; Texto y tipos de letra &gt; Tipos de letra</code>. Ajustar estos valores:<ul>\n<li><code>General</code>: <code>Noto Sans 11pt</code></li>\n<li><code>Anchura fija</code>: <code>Hack 10pt</code></li>\n<li><code>Pequeña</code>: <code>Noto Sans 9pt</code></li>\n<li><code>Barra de herramientas</code>: <code>Noto Sans 11pt</code></li>\n<li><code>Menú</code>: <code>Noto Sans 11pt</code></li>\n<li><code>Título de la ventana</code>: <code>Noto Sans 10pt</code></li>\n</ul>\n</li>\n<li>Botón derecho (L2) sobre la barra de tareas y seleccionar <code>Mostrar configuración del panel</code>. En <code>Preferencias del panel &gt; Altura del panel</code> subir la altura a 54px.</li>\n<li>Botón derecho (L2) sobre el icono que sirve para mostrar los iconos ocultos en la bandeja del sistema y seleccionar <code>Configurar Bandeja del sistema</code>. En <code>General</code> seleccionar estos valores:<ul>\n<li><code>Tamaño de los iconos del panel</code>: <code>Escalar a la altura del panel</code></li>\n<li><code>Espacio entre los iconos del panel</code>: <code>Normal</code></li>\n</ul>\n</li>\n<li>Botón derecho (L2) sobre el icono que sirve para mostrar los iconos ocultos en la bandeja del sistema y seleccionar <code>Mostrar configuración del panel</code>. Veremos un minireloj que antes no se veía sobre el que pulsaremos con el botón derecho (L2). Seleccionamos <code>Mostrar alternativas</code> y de los elementos gráficos alternativos que aparecen escogemos <code>Reloj digital</code>.</li>\n</ul>\n<h2 id=\"configuracion-de-sddm\">Configuración de SDDM<a class=\"headerlink\" href=\"#configuracion-de-sddm\" title=\"Permanent link\">&para;</a></h2>\n<p>Finalmente vamos a mejorar la configuración del gestor de sesiones SDDM para que permita el teclado en pantalla, tenga mejor aspecto y muestre la pantalla en la orientación correcta:</p>\n<ol>\n<li>\n<p>Crear fichero <code>/etc/sddm.conf.d/10-wayland.conf</code> con el siguiente contenido:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"k\">[General]</span>\n<span class=\"na\">DisplayServer</span><span class=\"o\">=</span><span class=\"s\">wayland</span>\n<span class=\"na\">GreeterEnvironment</span><span class=\"o\">=</span><span class=\"s\">QT_WAYLAND_SHELL_INTEGRATION=layer-shell</span>\n\n<span class=\"k\">[Wayland]</span>\n<span class=\"na\">CompositorCommand</span><span class=\"o\">=</span><span class=\"s\">kwin_wayland --drm --no-lockscreen --no-global-shortcuts --locale1 --inputmethod maliit-keyboard</span>\n</code></pre></div>\n</li>\n<li>\n<p>Abrir <code>Preferencias &gt; Pantalla de inicio de sesión (SDDM)</code>, seleccionar Brisa como theme y pulsar el botón <code>Aplicar las preferencias de Plasma...</code> arriba a la derecha.</p>\n</li>\n</ol>\n<h2 id=\"configuracion-sonido\">Configuración sonido<a class=\"headerlink\" href=\"#configuracion-sonido\" title=\"Permanent link\">&para;</a></h2>\n<p>Tal y como <a href=\"https://wiki.archlinux.org/title/Steam_Deck#Audio\">comenta el wiki de Arch</a>, el volumen por defecto en la Steam Deck es muy bajo. Para solucionarlo hay que instalar el paquete <code>alsa-utils</code> y ejecutar el comando <code>alsamixer</code> para ajustar el volumen de algunos de los canales.</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>alsa-utils\n$<span class=\"w\"> </span>alsamixer\n</code></pre></div>\n<p>Para acceder a los mismos, una vez en <code>alsamixer</code>, hay que pulsar <code>F6</code> para poder seleccionar el dispositivo de audio <code>acp5x</code> ya que por defecto aparecen seleccionado el dispositivo 0 que es el asociado a la salida HDMI del chip gráfico:</p>\n<p><img alt=\"alsamixer\" src=\"images/posts/2024-09-04_steam_deck_arch/alsamixer-select-device.png\" /></p>\n<p>Una vez seleccionado el dispositivo correcto, veremos todos sus canales que son muy numerosos. Localizaremos los que <a href=\"https://wiki.archlinux.org/title/Steam_Deck#Audio\">menciona el wiki</a> para ajustarlos a los siguientes valores:</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align: left;\">Canal</th>\n<th style=\"text-align: right;\">Valor</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align: left;\">Analog PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Digital</td>\n<td style=\"text-align: right;\">86%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Digital PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Left Analog PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Left Digital PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Right Analog PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Right Digital PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"instalacion-pamac\">Instalación pamac<a class=\"headerlink\" href=\"#instalacion-pamac\" title=\"Permanent link\">&para;</a></h2>\n<p>Para facilitar la instalación de paquetes desde la interfaz gráfica, vamos a instalar <code>pamac</code>:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>yay<span class=\"w\"> </span>-S<span class=\"w\"> </span>pamac-aur\n</code></pre></div>\n<p>Una vez instalado lo abrimos (buscando <code>Añadir/Quitar software</code> en el cajón de aplicaciones) y activamos el soporte AUR en <code>Preferencias &gt; Terceros &gt; Activar soporte de AUR</code>.</p>\n<h2 id=\"instalacion-gestor-dualboot\">Instalación gestor dualboot<a class=\"headerlink\" href=\"#instalacion-gestor-dualboot\" title=\"Permanent link\">&para;</a></h2>\n<p>El sistema Arch ya está listo y podemos arrancarlo encendiendo la consola en modo Boot Manager (manteniendo pulsada la tecla de bajar volumen) y seleccionando la opción <code>Arch</code>. Pero para facilitar el arranque de SteamOS, vamos a instalar un gestor de arranque dualboot llamado <a href=\"https://github.com/jlobue10/SteamDeck_rEFInd\">rEFInd</a>.</p>\n<ol>\n<li>Arrancar SteamOS (con Volume- + Power).</li>\n<li>\n<p>Desde una terminal en modo escritorio ejecutar:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"nb\">cd</span><span class=\"w\"> </span><span class=\"nv\">$HOME</span><span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>rm<span class=\"w\"> </span>-rf<span class=\"w\"> </span><span class=\"nv\">$HOME</span>/SteamDeck_rEFInd/<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://github.com/jlobue10/SteamDeck_rEFInd<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>SteamDeck_rEFInd<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>chmod<span class=\"w\"> </span>+x<span class=\"w\"> </span>install-GUI.sh<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>./install-GUI.sh\n</code></pre></div>\n</li>\n<li>\n<p>Descargar o crear un icono de Arch Linux de 128x128px.</p>\n</li>\n<li>Abrir el lanzador del escritorio que encontraremos en el escritorio.</li>\n<li>\n<p>Configurar de la siguiente forma (seleccionar en el campo <code>Boot Option #2 Icon</code> el icono descargado o creado anteriormente):</p>\n<p><img alt=\"Configuración de rEFInd\" src=\"images/posts/2024-09-04_steam_deck_arch/rEFInd_conf.png\" /></p>\n</li>\n<li>\n<p>Pulsar botón <code>Create Config</code>.</p>\n</li>\n<li>\n<p>Editar el fichero que encontraremos en <code>~/.local/SteamDeck_rEFInd/GUI/refind.conf</code> y modificar la última entrada de la siguiente forma:</p>\n<div class=\"highlight\"><pre><span></span><code>menuentry &quot;Arch&quot; {\n    icon /EFI/refind/os_icon2.png\n    loader /EFI/Arch/grubx64.efi\n    graphics on\n}\n</code></pre></div>\n</li>\n<li>\n<p>Pulsar el botón <code>Install rEFInd</code>.</p>\n</li>\n<li>Pulsar el botón <code>Install Config</code></li>\n</ol>\n<p>La ruta <code>/EFI/Arch/grubx64.efi</code> del paso 6 puede cambiar si en el comando <code>grub-install</code> ejecutado durante la <a href=\"#instalacion-base\">instalación del sistema base</a> se eligió otro identificador que no fuera <code>Arch</code>. En ese caso habría que adaptar la ruta.</p>\n<h2 id=\"conclusion\">Conclusión<a class=\"headerlink\" href=\"#conclusion\" title=\"Permanent link\">&para;</a></h2>\n<p>Y esto sería todo. Ahora tenemos un sistema Arch Linux en nuestra Steam Deck con un gestor de arranque dualboot que nos permite arrancar también SteamOS. A partir de aquí tendremos una máquina con una naturaleza doble, una (SteamOS) para jugar y otra (Arch) para ser utilizada como un PC (Plasma) o tabletPC (Plasma Mobile).</p>\n<p>Para elegir el entorno gráfico Plasma normal o el Plasma Mobile, utilizaremos el menú desplegable que aparece abajo a la izquierda en el gestor de inicios de sesión SDDM.</p>\n<iframe width=\"688\" height=\"387\" src=\"https://www.youtube.com/embed/hColcI3rv38\" title=\"Arch Linux en Steam Deck\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<p>Algunos enlaces de interés consultados durante la elaboración de esta guía:</p>\n<ul>\n<li><a href=\"https://www.freecodecamp.org/news/how-to-install-arch-linux/\">The Arch Linux Handbook – Learn Arch Linux for Beginners</a></li>\n<li><a href=\"https://asgardius.company/?p=1783\">Instalando Arch Linux con KDE en Steam Deck</a></li>\n<li><a href=\"https://wiki.archlinux.org/title/Steam_Deck\">Steam Deck - ArchWiki</a></li>\n</ul>", "image": "https://apuntes.eduardofilo.es/images/posts/2024-09-04_steam_deck_arch/steam_deck_logo.png", "date_published": "2024-09-04T15:30:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/en/2024-09-04_steam_deck_arch.html", "url": "https://apuntes.eduardofilo.es/en/2024-09-04_steam_deck_arch.html", "title": "Installing Arch Linux on Steam Deck", "content_html": "<p><img alt=\"Steam Deck with Arch Linux\" src=\"../images/posts/2024-09-04_steam_deck_arch/steam_deck_logo.png\" /></p>\n<div class=\"admonition info\">\n<p class=\"admonition-title\">Loss of dual boot after updating SteamOS</p>\n<p>In the update of SteamOS to the 3.6 branch (specifically, the first stable version of that branch was 3.6.19), the dual-boot configuration was lost, so the machine would only boot into SteamOS. The solution was to follow the steps in <a href=\"#dual-boot-manager-installation\">Dual Boot manager installation</a> starting from step 4.</p>\n</div>\n<p>In July 2024, the 512GB LCD model of the Steam Deck was available for under €400 for a few weeks. This price was very appealing for a <a href=\"https://www.steamdeck.com/es/tech/deck\">decent machine</a> with an AMD processor based on x86 (AMD64) architecture, 16GB of RAM, an NVMe SSD of the mentioned capacity, a touchscreen, and integrated gaming controls. Essentially, it's a handheld PC, but still a PC. What makes this machine especially attractive to me is its full Linux support, making it an ideal platform for tinkering with Linux distributions or using it as a secondary portable PC. Of course, this is in addition to its conventional use for gaming and <a href=\"https://www.emudeck.com/\">emulating</a> video games.</p>\n<p>SteamOS, the default operating system, is based on Arch Linux, and in desktop mode, it can be used almost like a regular Arch Linux system. The main restriction is that it's built in immutable mode. While this type of system configuration has its virtues and it's understandable why Valve chose it for their machine, I still prefer a normal (mutable) system. So, I decided to install a regular Arch Linux and learn how to install this distribution. According to the <a href=\"https://wiki.archlinux.org/title/Steam_Deck\">Arch wiki</a>, the hardware of the Steam Deck LCD model is 100% supported by Arch.</p>\n<p>The following is the complete procedure I used.</p>\n<h2 id=\"keyboardmouse\">Keyboard/Mouse<a class=\"headerlink\" href=\"#keyboardmouse\" title=\"Permanent link\">&para;</a></h2>\n<p>Although most operations can be performed using the Steam Deck's touchscreen and trackpads, it's highly recommended to connect a keyboard and mouse to the console to facilitate the installation, especially during the terminal session where we'll install the base system. The Steam Deck only has one USB-C port, so the most practical solution is to use a dock. It may also suffice (especially if we run live systems from a microSD) to use a wireless keyboard/mouse dongle connected with a USB&lt;-&gt;USB-C adapter, though in that case, it's advisable to ensure the Steam Deck is fully charged.</p>\n<p>In my case, I used a Dell <a href=\"https://www.dell.com/es-es/shop/adaptador-multipuerto-usb-c-de-dell-7-en-1-da310/apd/470-aeup/conexi%C3%B3n-wifi-y-redes\">DA310z</a> dock.</p>\n<h2 id=\"disk-repartitioning\">Disk repartitioning<a class=\"headerlink\" href=\"#disk-repartitioning\" title=\"Permanent link\">&para;</a></h2>\n<p>The Steam Deck's SSD I purchased is 512GB and of the NVMe type. This is the minimum size if we want to install another system alongside SteamOS.</p>\n<p>Before starting the installation, we need to make space by shrinking the main partition (number 8). For this, we can use almost any live Linux distribution that we boot from a removable drive (USB or microSD) since all of them come with some partition management program. I used a <code>gparted</code> ISO.</p>\n<p>The complete procedure can be seen below:</p>\n<ol>\n<li>Download the <a href=\"https://gparted.org/download.php\">gparted ISO</a>. Specifically, I used <a href=\"https://downloads.sourceforge.net/gparted/gparted-live-1.6.0-3-amd64.iso\">this version</a>.</li>\n<li>Install the ISO on a USB drive or, even better, on a microSD (since the Steam Deck has a slot for these). You can use a program like <a href=\"https://www.balena.io/etcher/\">Balena Etcher</a> or the <code>dd</code> command in Linux if you <a href=\"sistemas/raspi.html#backup-de-la-sd-comprimiendo-al-vuelo\">know how to use it</a>.</li>\n<li>Boot the Steam Deck with the USB drive or microSD inserted by holding down the volume- button until you hear the power-up tones. This causes the console to boot into the <code>Boot Manager</code> menu.</li>\n<li>Select the option to boot from the removable device, which will appear in the menu as <code>EFI USB Device (USB)</code> or <code>EFI SD/MMC Card (XX XXXX XXXX)</code> depending on whether you used a USB drive or a microSD respectively.</li>\n<li>\n<p>A configuration screen appears where we make the following selections:</p>\n<ul>\n<li>Policy for handling keymaps =&gt; Don't touch keymap</li>\n<li>Which language do you prefer? =&gt; 25</li>\n<li>Which mode do you prefer? =&gt; 0</li>\n</ul>\n</li>\n<li>\n<p>After accepting the last option, the <code>gparted</code> program will start in graphical mode (with the screen rotated, though). We will make changes until the partitions look like the screenshot. Essentially, we'll shrink partition #8 by about 100GB, create #9 with 4GB for swap, and #10 with the remaining space for the Arch root system:</p>\n<p><img alt=\"Steam Deck Partitions\" src=\"../images/posts/2024-09-04_steam_deck_arch/steam-deck-partitions.png\" /></p>\n</li>\n</ol>\n<p>Note, when looking at the partitions used by SteamOS, that it uses an <a href=\"https://blog.davidbyrne.dev/2018/08/16/linux-ab-partitions\">A/B partition system</a>, common in Android, where most of the system partitions (except the user space one) are duplicated. This system is designed to facilitate updates, or rather to roll back in case of problems during them.</p>\n<h2 id=\"base-installation\">Base installation<a class=\"headerlink\" href=\"#base-installation\" title=\"Permanent link\">&para;</a></h2>\n<p>For the base system installation, I opted for the conventional method following the instructions in the <a href=\"https://wiki.archlinux.org/title/Installation_guide\">installation guide</a> on the Arch wiki. This installation uses an Arch system ISO that we can boot from a removable drive (USB or microSD) to install the basic packages needed for a bootable and very basic system.</p>\n<p>Before starting, note that due to the dynamic nature of the Arch Linux distribution, it's very likely that this guide will become outdated soon. Therefore, I recommend checking the <a href=\"https://wiki.archlinux.org/title/Installation_guide\">official guide</a> if something doesn't go as expected.</p>\n<p>Below is the step-by-step installation process:</p>\n<ol>\n<li>Download the <a href=\"https://archlinux.org/download/\">Arch Linux ISO</a>. Specifically, I used <a href=\"https://es.mirrors.cicku.me/archlinux/iso/2024.08.01/archlinux-2024.08.01-x86_64.iso\">this version</a>.</li>\n<li>Install the ISO on a USB drive or, even better, on a microSD to use the slot on the Steam Deck. You can use a program like <a href=\"https://www.balena.io/etcher/\">Balena Etcher</a> or the <code>dd</code> command in Linux if you <a href=\"sistemas/raspi.html#backup-de-la-sd-comprimiendo-al-vuelo\">know how to use it</a>.</li>\n<li>Boot the Steam Deck with the USB drive or microSD inserted by holding down the volume- button until you hear the power-up tones. This causes the console to boot into the <code>Boot Manager</code> menu.</li>\n<li>Select the option to boot from the removable device, which will appear in the menu as <code>EFI USB Device (USB)</code> or <code>EFI SD/MMC Card (XX XXXX XXXX)</code> depending on whether you used a USB drive or a microSD respectively.</li>\n<li>\n<p>Once the Arch live installation system finishes booting, run the following commands in order (in the <code>iwctl</code> session, replace <code>&lt;SSID&gt;</code> with your own and enter the password when prompted; also replace the user identifier <code>&lt;USER&gt;</code> with the one you want to use):</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># loadkeys en</span>\n<span class=\"c1\"># iwctl</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># station wlan0 scan</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># station wlan0 get-networks</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># station wlan0 connect &lt;SSID&gt;</span>\n<span class=\"o\">[</span>iwd<span class=\"o\">]</span><span class=\"c1\"># exit</span>\n<span class=\"c1\"># mkfs.ext4 /dev/nvme0n1p10</span>\n<span class=\"c1\"># mkswap /dev/nvme0n1p9</span>\n<span class=\"c1\"># mount /dev/nvme0n1p10 /mnt</span>\n<span class=\"c1\"># mount --mkdir /dev/nvme0n1p1 /mnt/boot/efi</span>\n<span class=\"c1\"># swapon /dev/nvme0n1p9</span>\n<span class=\"c1\"># pacstrap -K /mnt base base-devel linux linux-firmware sudo vi ntfs-3g networkmanager amd-ucode grub efibootmgr git cmake qt5-wayland</span>\n<span class=\"c1\"># genfstab -U /mnt &gt;&gt; /mnt/etc/fstab</span>\n<span class=\"c1\"># arch-chroot /mnt</span>\n<span class=\"c1\"># ln -sf /usr/share/zoneinfo/Europe/Madrid /etc/localtime</span>\n<span class=\"c1\"># hwclock --systohc</span>\n<span class=\"c1\"># vi /etc/locale.gen    # uncomment &#39;en_US.UTF-8 UTF-8&#39;</span>\n<span class=\"c1\"># locale-gen</span>\n<span class=\"c1\"># echo &quot;LANG=en_US.UTF-8&quot; &gt; /etc/locale.conf</span>\n<span class=\"c1\"># echo &quot;KEYMAP=en&quot; &gt; /etc/vconsole.conf</span>\n<span class=\"c1\"># echo &quot;deck&quot; &gt; /etc/hostname</span>\n<span class=\"c1\"># echo -e &quot;\\n127.0.0.1    localhost\\n::1    localhost\\n127.0.1.1    deck&quot; &gt;&gt; /etc/hosts</span>\n<span class=\"c1\"># passwd</span>\n<span class=\"c1\"># grub-install --target=x86_64-efi --efi-directory=/boot/efi --bootloader-id=Arch</span>\n<span class=\"c1\"># grub-mkconfig -o /boot/grub/grub.cfg</span>\n<span class=\"c1\"># systemctl enable NetworkManager</span>\n<span class=\"c1\"># useradd -m -G wheel,audio,video,storage &lt;USER&gt;</span>\n<span class=\"c1\"># passwd &lt;USER&gt;</span>\n<span class=\"c1\"># chmod u+w /etc/sudoers</span>\n<span class=\"c1\"># vi /etc/sudoers       # Uncomment &#39;%wheel ALL=(ALL) ALL&#39;</span>\n<span class=\"c1\"># chmod u-w /etc/sudoers</span>\n<span class=\"c1\"># pacman -Syy</span>\n<span class=\"c1\"># pacman -S xorg-server xf86-video-amdgpu maliit-keyboard qt5-wayland</span>\n<span class=\"c1\"># su - &lt;USER&gt;</span>\n</code></pre></div>\n</li>\n</ol>\n<p>The password you choose when running the <code>passwd &lt;USER&gt;</code> command should be numeric if you want to use Plasma Mobile, as the unlock screen only allows you to enter a PIN.</p>\n<h2 id=\"graphical-environment-installation\">Graphical environment installation<a class=\"headerlink\" href=\"#graphical-environment-installation\" title=\"Permanent link\">&para;</a></h2>\n<p>Continuing from where we left off, that is, in the chroot session from the Arch Linux live installation system. We will now do this as a normal user (not root), so from now on, we will frequently use <code>sudo</code>.</p>\n<p>Now we are going to install the graphical environments. I say this in plural because we will install two: Plasma and Plasma Mobile. I do this because, depending on whether we will use the Steam Deck with Arch in desktop mode (with keyboard/mouse and possibly a screen) or portable mode (without keyboard/mouse), one system or the other will be more convenient, as Plasma Mobile has an interface designed to be operated with a touchscreen (tablet-style).</p>\n<p>Really, it's not necessary to install both desktops, so their installation steps are separated. You can install one, the other, or both.</p>\n<h4 id=\"plasma\">Plasma<a class=\"headerlink\" href=\"#plasma\" title=\"Permanent link\">&para;</a></h4>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>plasma-meta\n</code></pre></div>\n<p>During the installation of the above package, you will be asked several questions. On the third question, answer <code>2) noto-fonts</code>. For the rest, provide the default answer (by pressing enter).</p>\n<h4 id=\"plasma-mobile\">Plasma Mobile<a class=\"headerlink\" href=\"#plasma-mobile\" title=\"Permanent link\">&para;</a></h4>\n<p>Plasma Mobile is not yet available in the official repositories. We have to use <a href=\"https://aur.archlinux.org/\">AUR</a>:</p>\n<ol>\n<li>\n<p>Start by installing some dependencies:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>plasma-workspace<span class=\"w\"> </span>kcontacts<span class=\"w\"> </span>kirigami2<span class=\"w\"> </span>kpeople<span class=\"w\"> </span>libphonenumber\n</code></pre></div>\n</li>\n<li>\n<p>Install the AUR packages <code>plasma-nano</code>, <code>plasma-settings</code>, and <code>plasma-mobile</code> in this order:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>~\n$<span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://aur.archlinux.org/plasma-nano.git\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>plasma-nano\n$<span class=\"w\"> </span>makepkg<span class=\"w\"> </span>-si\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>~\n$<span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://aur.archlinux.org/plasma-settings.git\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>plasma-settings\n$<span class=\"w\"> </span>makepkg<span class=\"w\"> </span>-si\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>~\n$<span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://aur.archlinux.org/plasma-mobile.git\n$<span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>plasma-mobile\n$<span class=\"w\"> </span>makepkg<span class=\"w\"> </span>-si\n</code></pre></div>\n</li>\n</ol>\n<h4 id=\"end-of-graphical-environment-installation\">End of graphical environment installation<a class=\"headerlink\" href=\"#end-of-graphical-environment-installation\" title=\"Permanent link\">&para;</a></h4>\n<ol>\n<li>\n<p>Install the SDDM session manager and some applications, which we'll need to finish the installation from the graphical mode:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>sddm<span class=\"w\"> </span>konsole<span class=\"w\"> </span>dolphin<span class=\"w\"> </span>kwrite<span class=\"w\"> </span>partitionmanager<span class=\"w\"> </span>power-profiles-daemon\n$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>systemctl<span class=\"w\"> </span><span class=\"nb\">enable</span><span class=\"w\"> </span>sddm\n$<span class=\"w\"> </span><span class=\"nb\">exit</span>\n</code></pre></div>\n</li>\n<li>\n<p>Close the chroot session, unmount the partitions, and reboot the system:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"c1\"># exit</span>\n<span class=\"c1\"># umount -R /mnt</span>\n<span class=\"c1\"># reboot</span>\n</code></pre></div>\n</li>\n</ol>\n<h2 id=\"basic-configuration\">Basic configuration<a class=\"headerlink\" href=\"#basic-configuration\" title=\"Permanent link\">&para;</a></h2>\n<p>After rebooting, you should see the SDDM session manager, initially with the screen rotated and without the ability to use the on-screen keyboard, so we'll still be using the external keyboard and mouse.</p>\n<p>Once we have logged into Plasma or Plasma Mobile, the first thing we need to do is configure the internet connection. To do this, click on the corresponding icon in the system tray at the bottom right in Plasma or at the top right in Plasma Mobile.</p>\n<p>Once connected, open the Konsole application and run the following commands to install the basic KDE application package, Firefox browser and the SSH server:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>firefox<span class=\"w\"> </span>kde-applications-meta<span class=\"w\"> </span>openssh<span class=\"w\"> </span>usbutils<span class=\"w\"> </span>lshw<span class=\"w\"> </span>man-db<span class=\"w\"> </span>htop<span class=\"w\"> </span>spectacle\n$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>systemctl<span class=\"w\"> </span>start<span class=\"w\"> </span>sshd\n$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>systemctl<span class=\"w\"> </span><span class=\"nb\">enable</span><span class=\"w\"> </span>sshd\n</code></pre></div>\n<p>Finally, we make the following configurations:</p>\n<ul>\n<li><code>Preferences &gt; System Preferences &gt; Input &amp; Output &gt; Display &amp; Monitor &gt; Scale</code>: Set the screen scale to 110%.</li>\n<li><code>Preferences &gt; System Preferences &gt; Input &amp; Output &gt; Keyboard &gt; Layouts &gt; Configure Layouts &gt; Add</code>: Add the English keyboard layout.</li>\n<li><code>Preferences &gt; System Preferences &gt; Input &amp; Output &gt; Keyboard &gt; Virtual Keyboard</code>: Select <code>Maliit</code>.</li>\n<li><code>Preferences &gt; System Preferences &gt; Language &amp; Time &gt; Date &amp; Time &gt; Time Zone</code>: Select your city.</li>\n<li><code>Preferences &gt; System Preferences &gt; Appearance &amp; Style &gt; Text &amp; Fonts &gt; Fonts</code>. Set this values:<ul>\n<li><code>General</code>: <code>Noto Sans 11pt</code></li>\n<li><code>Fixed width</code>: <code>Hack 10pt</code></li>\n<li><code>Small</code>: <code>Noto Sans 9pt</code></li>\n<li><code>Toolbar</code>: <code>Noto Sans 11pt</code></li>\n<li><code>Menu</code>: <code>Noto Sans 11pt</code></li>\n<li><code>Window title</code>: <code>Noto Sans 10pt</code></li>\n</ul>\n</li>\n<li>Right-click (L2) on the taskbar and select <code>Show panel settings</code>. In <code>Panel Preferences &gt; Panel Height</code> increase the height to 54px.</li>\n<li>Right-click (L2) on the icon used to show hidden icons in the system tray and select <code>Configure System Tray</code>. In <code>General</code> select these values:<ul>\n<li><code>Panel icon size</code>: <code>Scale to panel height</code></li>\n<li><code>Spacing between panel icons</code>: <code>Normal</code></li>\n</ul>\n</li>\n<li>Right-click (L2) on the icon used to show hidden icons in the system tray and select <code>Show panel settings</code>. You will see a small clock that was not visible before, right-click (L2) on it. Select <code>Show alternatives</code> and from the alternative graphics that appear, choose <code>Digital clock</code>.</li>\n</ul>\n<h2 id=\"sddm-configuration\">SDDM configuration<a class=\"headerlink\" href=\"#sddm-configuration\" title=\"Permanent link\">&para;</a></h2>\n<p>Finally, we'll improve the SDDM session manager configuration to enable the on-screen keyboard, enhance the appearance, and display the screen in the correct orientation:</p>\n<ol>\n<li>\n<p>Create the file <code>/etc/sddm.conf.d/10-wayland.conf</code> with the following content:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"k\">[General]</span>\n<span class=\"na\">DisplayServer</span><span class=\"o\">=</span><span class=\"s\">wayland</span>\n<span class=\"na\">GreeterEnvironment</span><span class=\"o\">=</span><span class=\"s\">QT_WAYLAND_SHELL_INTEGRATION=layer-shell</span>\n\n<span class=\"k\">[Wayland]</span>\n<span class=\"na\">CompositorCommand</span><span class=\"o\">=</span><span class=\"s\">kwin_wayland --drm --no-lockscreen --no-global-shortcuts --locale1 --inputmethod maliit-keyboard</span>\n</code></pre></div>\n</li>\n<li>\n<p>Open <code>Preferences &gt; Login Screen (SDDM)</code>, select Breeze as the theme, and click the <code>Apply Plasma settings...</code> button in the top right corner.</p>\n</li>\n</ol>\n<h2 id=\"sound-configuration\">Sound configuration<a class=\"headerlink\" href=\"#sound-configuration\" title=\"Permanent link\">&para;</a></h2>\n<p>As <a href=\"https://wiki.archlinux.org/title/Steam_Deck#Audio\">the Arch wiki mentions</a>, the default volume on the Steam Deck is very low. To fix this, you need to install the <code>alsa-utils</code> package and run the <code>alsamixer</code> command to adjust the volume of some of the channels.</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>sudo<span class=\"w\"> </span>pacman<span class=\"w\"> </span>-S<span class=\"w\"> </span>alsa-utils\n$<span class=\"w\"> </span>alsamixer\n</code></pre></div>\n<p>To access them, once in <code>alsamixer</code>, press <code>F6</code> to select the <code>acp5x</code> audio device, as by default the selected device is 0, which is associated with the HDMI output of the graphics chip:</p>\n<p><img alt=\"alsamixer\" src=\"../images/posts/2024-09-04_steam_deck_arch/alsamixer-select-device.png\" /></p>\n<p>Once the correct device is selected, you will see all its channels, which are quite numerous. Locate the ones <a href=\"https://wiki.archlinux.org/title/Steam_Deck#Audio\">mentioned in the wiki</a> and adjust them to the following values:</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align: left;\">Channel</th>\n<th style=\"text-align: right;\">Value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align: left;\">Analog PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Digital</td>\n<td style=\"text-align: right;\">86%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Digital PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Left Analog PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Left Digital PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Right Analog PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Right Digital PCM</td>\n<td style=\"text-align: right;\">85%</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"pamac-installation\">Pamac Installation<a class=\"headerlink\" href=\"#pamac-installation\" title=\"Permanent link\">&para;</a></h2>\n<p>To facilitate package installation from the graphical interface, we are going to install <code>pamac</code>:</p>\n<div class=\"highlight\"><pre><span></span><code>$<span class=\"w\"> </span>yay<span class=\"w\"> </span>-S<span class=\"w\"> </span>pamac-aur\n</code></pre></div>\n<p>Once installed, open it (by searching for <code>Add/Remove Software</code> in the application drawer) and enable AUR support in <code>Preferences &gt; Third Party &gt; Enable AUR support</code>.</p>\n<h2 id=\"dual-boot-manager-installation\">Dual Boot manager installation<a class=\"headerlink\" href=\"#dual-boot-manager-installation\" title=\"Permanent link\">&para;</a></h2>\n<p>The Arch system is now ready and can be booted by starting the console in Boot Manager mode (holding down the volume- key) and selecting the <code>Arch</code> option. But to make it easier to boot SteamOS, we'll install a dual boot manager called <a href=\"https://github.com/jlobue10/SteamDeck_rEFInd\">rEFInd</a>.</p>\n<ol>\n<li>Boot SteamOS (with Volume- + Power).</li>\n<li>\n<p>From a terminal in desktop mode, run:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"nb\">cd</span><span class=\"w\"> </span><span class=\"nv\">$HOME</span><span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>rm<span class=\"w\"> </span>-rf<span class=\"w\"> </span><span class=\"nv\">$HOME</span>/SteamDeck_rEFInd/<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>git<span class=\"w\"> </span>clone<span class=\"w\"> </span>https://github.com/jlobue10/SteamDeck_rEFInd<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span><span class=\"nb\">cd</span><span class=\"w\"> </span>SteamDeck_rEFInd<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>chmod<span class=\"w\"> </span>+x<span class=\"w\"> </span>install-GUI.sh<span class=\"w\"> </span><span class=\"o\">&amp;&amp;</span><span class=\"w\"> </span>./install-GUI.sh\n</code></pre></div>\n</li>\n<li>\n<p>Download or create an Arch Linux icon of 128x128px.</p>\n</li>\n<li>Open the desktop launcher found on the desktop.</li>\n<li>\n<p>Configure it as follows (select the icon downloaded or created earlier in the <code>Boot Option #2 Icon</code> field):</p>\n<p><img alt=\"rEFInd Configuration\" src=\"../images/posts/2024-09-04_steam_deck_arch/rEFInd_conf.png\" /></p>\n</li>\n<li>\n<p>Click the <code>Create Config</code> button.</p>\n</li>\n<li>\n<p>Edit the file found at <code>~/.local/SteamDeck_rEFInd/GUI/refind.conf</code> and modify the last entry as follows:</p>\n<div class=\"highlight\"><pre><span></span><code>menuentry &quot;Arch&quot; {\n    icon /EFI/refind/os_icon2.png\n    loader /EFI/Arch/grubx64.efi\n    graphics on\n}\n</code></pre></div>\n</li>\n<li>\n<p>Click the <code>Install rEFInd</code> button.</p>\n</li>\n<li>Click the <code>Install Config</code> button.</li>\n</ol>\n<p>The path <code>/EFI/Arch/grubx64.efi</code> in step 6 may change if you chose a different identifier than <code>Arch</code> during the <code>grub-install</code> command executed during the <a href=\"#base-installation\">base system installation</a>. In that case, you'll need to adapt the path.</p>\n<h2 id=\"conclusion\">Conclusion<a class=\"headerlink\" href=\"#conclusion\" title=\"Permanent link\">&para;</a></h2>\n<p>And that's it. Now we have an Arch Linux system on our Steam Deck with a dual boot manager that allows us to boot into SteamOS as well. From here, we have a machine with a dual nature, one (SteamOS) for gaming and another (Arch) to be used as a PC (Plasma) or tablet PC (Plasma Mobile).</p>\n<p>To choose between the normal Plasma or Plasma Mobile graphical environment, use the dropdown menu that appears at the bottom left in the SDDM login manager.</p>\n<iframe width=\"688\" height=\"387\" src=\"https://www.youtube.com/embed/hColcI3rv38\" title=\"Arch Linux on Steam Deck\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<p>Some interesting links consulted during the creation of this guide:</p>\n<ul>\n<li><a href=\"https://www.freecodecamp.org/news/how-to-install-arch-linux/\">The Arch Linux Handbook – Learn Arch Linux for Beginners</a></li>\n<li><a href=\"https://asgardius.company/?p=1783\">Instalando Arch Linux con KDE en Steam Deck</a></li>\n<li><a href=\"https://wiki.archlinux.org/title/Steam_Deck\">Steam Deck - ArchWiki</a></li>\n</ul>", "image": "https://apuntes.eduardofilo.es/images/posts/2024-09-04_steam_deck_arch/steam_deck_logo.png", "date_published": "2024-09-04T15:30:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/2024-05-31_campus_aula_dei_en_bici.html", "url": "https://apuntes.eduardofilo.es/2024-05-31_campus_aula_dei_en_bici.html", "title": "Vías Zaragoza - Campus en bicicleta", "content_html": "<p><img alt=\"Pelotón ciclista\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/peloton.jpg\" />\nFoto de Javier Rodrigo</p>\n<div class=\"admonition warning\">\n<p class=\"admonition-title\">Ruta por margen derecha cortada</p>\n<p>El camino que discurre por la margen derecha del Gállego (la ruta con nombre \"Azud - Campus (por margen der. Gállego)\" en la tabla final) está cortado por desprendimientos entre los waypoints 14 y 15, cuando se pasa junto a un muro que rodea un terreno muy próximo al propio río, al menos en fecha 2025-02-18. Una opción para evitar ese punto es salir momentáneamente a la carretera de Cogullada que discurre frente al lado opuesto del terreno con el muro.</p>\n</div>\n<p>Actualmente trabajo en el Campus de Aula Dei, a unos 15Km de Zaragoza. Aunque existen varias opciones para acudir al campus en autobús, en mi caso particular la combinación de rutas y horarios no es favorable, por lo que desde un principio opté por ir en bicicleta. Tras unos días realizando pruebas, ajusté la ruta y la equipación para hacerla más conveniente y segura. En este post enumero las distintas opciones que he terminado conociendo y describo a mi parecer sus ventajas e inconvenientes.</p>\n<h2 id=\"problemas-y-soluciones\">Problemas y soluciones<a class=\"headerlink\" href=\"#problemas-y-soluciones\" title=\"Permanent link\">&para;</a></h2>\n<p>Hay que comentar desde un principio que desafortunadamente el acceso al campus en bicicleta no es muy favorable. Por un lado existen las barreras naturales de la acequia de Urdán y sobre todo el río Gállego para el que existen muy pocos pasos. Si no tenemos en cuenta los puentes de las distintas carreteras, sólo existen las pasarelas peatonales de <a href=\"https://osm.org/go/b_84LYjOF-?m=\">Santa Isabel</a> y la <a href=\"https://osm.org/go/b_85hJ7oE-?m=\">próxima a San Juan de Mozarrifar</a> que se indican en el plano siguiente. La foto que hay a continuación del plano es de la segunda pasarela.</p>\n<p><img alt=\"Pasarelas Gállego\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/pasarelas_gallego.png\" /></p>\n<p><img alt=\"Paso peatonal San Juan de Mozarrifar\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/paso_peatonal_san_juan.jpg\" /></p>\n<p>Por otro lado, la carretera de acceso al campus (A-123) carece de arcén en gran parte de su trazado, tiene límite de 70 km/h, muchas incorporaciones/salidas y considerable tráfico de tractores, camiones y autobuses (sobre todo a las horas de comienzo y fin de la jornada), por lo que la considero inconveniente para ciclistas. Pero evitar las carreteras conlleva algunos inconvenientes que vamos a analizar.</p>\n<h4 id=\"ensuciamiento-de-la-bicicleta\">Ensuciamiento de la bicicleta<a class=\"headerlink\" href=\"#ensuciamiento-de-la-bicicleta\" title=\"Permanent link\">&para;</a></h4>\n<p>Los caminos en verano son muy polvorientos y en invierno se embarran y forman lagunas. Ambas situaciones ensucian la bicicleta, sobre todo el polvo en verano que ataca la transmisión (cadena, platos y piñones), bujes y pedalier. Para el barro y los charcos lo mejor es que la bicicleta disponga de guardabarros, aunque en mi caso particular no los puedo (ni quiero) poner.</p>\n<p>Considerando ambos problemas, aún así me he decantado por utilizar los caminos rurales y limpiar la bicicleta con la frecuencia que la situación requiera. Pero hay momentos puntuales, tras varios días de lluvia por ejemplo, en los que conviene tener una alternativa por asfalto. Para esa situación, y en mi caso particular, recurro a la carretera que conecta San Gregorio con San Juan de Mozarrifar que termina en la carretera de Cogullada, otra buena alternativa si se accede desde una zona situada al noroeste de Zaragoza. Ambos tramos de carretera tienen poco tráfico y límite de 50 km/h. Desde la carretera de Cogullada se puede acceder a la <a href=\"https://osm.org/go/b_85hJ7oE-?m=\">pasarela cerca de San Juan</a> saliendo hacia el campo de fútbol de San Juan.</p>\n<p>De todas formas en términos de minimizar el ensuciamiento y mantenimiento de la bicicleta, la mejor ruta en mi opinión es la que me enseñó el compañero Magí que utilizando la <a href=\"https://osm.org/go/b_84LYjOF-?m=\">pasarela de Santa Isabel</a> para superar el Gállego, transcurre por asfalto hasta más arriba de la Montañanesa. Es la denominada <code>Azud - Campus (margen izq. Gállego, asfalto)</code> en la tabla de rutas final. Poco antes de llegar a la acequia de Urdán (en <a href=\"https://osm.org/go/b_8406Z8?m=\">este punto</a>) tenemos las opciones de terminar por caminos rurales por la izquierda o girar a la derecha para salir <a href=\"https://osm.org/go/b_842C5~g-?m=\">delante de la Montañanesa</a> a la carretera de Montañana de la que recorreremos un pequeño tramo hasta tomar el <a href=\"https://osm.org/go/b_842ylME-?m=\">Camino el Soaso</a> para alcanzar el campus integramente por asfalto y por vías con poco tráfico. Si no utilizo personalmente esta ruta es porque tengo que dar algo de vuelta para poder acceder a ella y porque disfruto más rodando por caminos rurales con la bicicleta de montaña.</p>\n<p>Otra ruta un poco más larga pero íntegramente por asfalto y que minimiza el tránsito por la carretera de Montañana es la que me enseñó el compañero Ricardo y que desde Santa Isable discurre enteramente por calzadas paralelas a la de Montañana. Es la denominada <code>Azud - Campus (todo asfalto 3)</code> en la tabla de rutas final.</p>\n<p>En cuanto a la limpieza de la bicicleta en sí, he llegado al compromiso de fijarme exclusivamente en la transmisión (cadena, platos y piñones). He terminado usando lubicante basado en cera, que tiene el inconveniente de que hay que reponerlo cada pocos días (3 ó 4) pero a cambio la cadena no acumula la típica mugre mezcla de grasa y polvo. Utilizo el de la marca <a href=\"https://www.amazon.es/dp/B01CXILFJ6\">X-sauce</a> (en tiendas de comercio local cuesta la mitad que en Amazon).</p>\n<p>Una vez al mes llevo la bicicleta a un lavadero de coches. Empiezo limpiando la cadena con un <a href=\"https://www.decathlon.es/es/p/limpiador-cadena-bicicleta/_/R-p-334700?mc=8651030\">accesorio para facilitar la tarea</a> que lleno de desengrasante biodegradable (la marca <a href=\"https://www.amazon.es/dp/B084S7C3PX\">BLUB</a> en concreto me da un resultado excelente). Tras eso, retiro las pastillas de freno para que no se contaminen y le doy un manguerazo a la bicicleta. En casa seco, aplico <a href=\"https://www.amazon.es/dp/B00K7XZEZ6\">WD-40</a> en las articulaciones de los desviadores y lubrico la cadena con el producto mencionado antes.</p>\n<h4 id=\"charcos-y-barro\">Charcos y barro<a class=\"headerlink\" href=\"#charcos-y-barro\" title=\"Permanent link\">&para;</a></h4>\n<p>El tema de los charcos puede parecer menor, pero al menos la pasada temporada fría (2023/2024), desde octubre hasta abril han existido en varios puntos de mi ruta habitual, tres zonas difíciles de pasar, es decir, el problema va más allá de que se ensucie la bicicleta. Uno de los puntos es el <a href=\"https://osm.org/go/b_841ChW5?m=\">puente del ferrocarril</a> que accede a la Montañanesa en su paso sobre la pista que trascurre por la margen derecha del Gállego. Afortunadamente descubrí que poco antes de ese punto sale una vía a la derecha que permite pasar el puente por <a href=\"https://osm.org/go/b_840dYW?m=\">uno de sus vanos menores</a> más adelante.</p>\n<p><img alt=\"Paso bajo ferrocarril Montañanesa\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/paso_bajo_ferrocarril_montananesa.jpg\" /></p>\n<p>Otro paso incluso peor, dado que no existe alternativa una vez que estás allí (está entre una valla y un campo que en ocasiones no es practicable), es el que hay en un <a href=\"https://osm.org/go/b_84fr992?m=\">punto del camino muy próximo al puente comentado antes</a>. Durante todos estos meses fríos han existido unas lagunas cuyos bordes se mantenían permanentemente embarrados por el agua que desplazaban los vehículos al pasar. En los peores momentos la alternativa era dar un poco de vuelta subiendo un poco por la carretera de Cogullada para acceder al camino que discurre por el otro lado de la vía del ferrocarril y de paso evitar el puente.</p>\n<p><img alt=\"Lagunas\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/lagunas.jpg\" /></p>\n<h4 id=\"frio-y-noche\">Frío y noche<a class=\"headerlink\" href=\"#frio-y-noche\" title=\"Permanent link\">&para;</a></h4>\n<p>En invierno el principal enemigo es el frío en las manos y la iluminación. Para lo primero he probado muchos modelos de guantes con y sin calefacción, y no ha sido hasta adquirir los últimos que no he conseguido solucionar el problema. Desafortunadamente en el momento de escribir este artículo no se encuentran a la venta, aunque podría ser por no estar todavía en la temporada de invierno. Son el modelo \"HEAT CONCEPT BIKE\" de la marca <a href=\"https://www.ekoi.es\">Ekoi</a>.</p>\n<p>En cuanto a la iluminación, hace tiempo que adquirí un foco potente (parecido a <a href=\"https://es.aliexpress.com/item/1005007131009248.html\">éste</a>) para las excursiones veraniegas nocturnas. Empecé a tener problemas con la batería, pero por lo que he podido ver el formato de las mismas es bastante estándar o popular (8,4V) por lo que pude encontrar <a href=\"https://es.aliexpress.com/item/32877254810.html\">reemplazo</a> fácilmente.</p>\n<h4 id=\"mayor-riesgo-de-pinchazos\">Mayor riesgo de pinchazos<a class=\"headerlink\" href=\"#mayor-riesgo-de-pinchazos\" title=\"Permanent link\">&para;</a></h4>\n<p>Aquí sólo puedo hacer la natural recomendación de llevar bomba encima para por lo menos poder ir hinchando la rueda en caso de pinchar hasta llegar al destino. En mi caso llevo las ruedas montadas sin cámara o en tubeless, cosa que recomiendo a pesar de los inconvenientes que tiene (requiere mantenimiento y es mucho más engorroso desmontar el neumático). Gracias a ello me he podido olvidar del tema de los pinchazos desde hace años (salvo un par de episodios dramáticos en los que el neumático se hubiera destrozado llevase lo que llevase).</p>\n<h4 id=\"mas-tiempo-de-viaje\">Más tiempo de viaje<a class=\"headerlink\" href=\"#mas-tiempo-de-viaje\" title=\"Permanent link\">&para;</a></h4>\n<p>Utilizar los caminos rurales conlleva más tiempo por una parte por la menor velocidad de circulación y por otra por los rodeos que hay que hacer para lograr la conexión de pistas. Aunque como puede verse en el mapa final con las rutas, la mayoría son bastante directas.</p>\n<h4 id=\"orientacion-inicial\">Orientación inicial<a class=\"headerlink\" href=\"#orientacion-inicial\" title=\"Permanent link\">&para;</a></h4>\n<p>Relacionado con el punto anterior existe la posibilidad de despistarse, al menos durante los primeros días, sobre todo si se utiliza la opción de los caminos rurales, al no haber señalización y ser los caminos/campos parecidos. El primer día que intenté ir al campus en bicicleta fue un desastre. Tuve que improvisar en las proximidades del recinto porque la ruta que llevaba pretrazada con Google Maps me llevaba por un paso bloqueado. <a href=\"https://connect.garmin.com/modern/activity/11031310117\">Ese día</a> empleé una hora más de la cuenta dando vueltas por un terreno salvaje que hay entre el Gállego y el recinto del campus y más adelante atravesando unos campos encharcados que parecían una buena opción para atajar 🤦.</p>\n<p><img alt=\"La trampa mortal\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/trampa.png\" /></p>\n<p>Para evitar este problema, por una parte conviene utilizar la herramienta adecuada para trazar la ruta, que no es Google Maps como el compañero Miguel me enseñó, sino otra basada en los mapas de <a href=\"https://www.openstreetmap.org/\">OpenStreetMap</a> como <a href=\"https://graphhopper.com/maps\">GraphHopper</a> donde sí están correctamente mapeado el perímetro del recinto del campus. Por otra parte, conviene llevar un GPS que nos permita seguir la ruta sin tener que parar a mirar el mapa. En mi caso empecé utilizando un viejo Garmin Edge 305 que ya que ahora domino de memoria las distinas opciones, puedo prestar a otras personas que se animen a ir en bici al campus para que se aprendan el recorrido. Si se dispone de un soporte de manillar para smartphone, también se puede utilizar una aplicación de navegación como <a href=\"https://play.google.com/store/apps/details?id=net.osmand\">OsmAnd</a> con los tracks precargados.</p>\n<p><img alt=\"GPS\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/gps.jpg\" /></p>\n<h2 id=\"rutas\">Rutas<a class=\"headerlink\" href=\"#rutas\" title=\"Permanent link\">&para;</a></h2>\n<p>A continuación se enumera la coleccion de rutas que he seleccionado. Uno de los objetivos de la selección ha sido cubrir distintos puntos de partida repartidos por el noreste de Zaragoza. Otro el que existan opciones que discurran íntegramente por asfalto, bien por los días en que los caminos estén embarrados o pensando en las personas que sólo cuenten con bicicletas de carretera. El tiempo estimado que aparece en la tabla es una aproximación que puede variar en función de la forma física, el tipo de bicicleta y las condiciones meteorológicas (¡hola cierzo!). En la columna de observaciones se indican los puntos conflictivos o a tener en cuenta en cada ruta. Por último, la primera columna contiene un enlace para descargar los tracks GPX de forma que se puedan instalar en aplicaciones como la mencionada <a href=\"https://play.google.com/store/apps/details?id=net.osmand\">OsmAnd</a>.</p>\n<table>\n<thead>\n<tr>\n<th>Ruta</th>\n<th>Distancia</th>\n<th>Tiempo estimado</th>\n<th>Observaciones</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Juslibol-Actur---Campus-%28por-San-Gregorio%29.gpx\">Juslibol/Actur - Campus (por San Gregorio)</a></td>\n<td>14,38 km</td>\n<td>40m-1h</td>\n<td>Hay que cruzar la carretera de Huesca pero se puede hacer por paso elevado. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Arrabal-Picarral---Campus-%28por-Corbera-Alta%29.gpx\">Arrabal/Picarral - Campus (por Corbera Alta)</a></td>\n<td>13,05 km</td>\n<td>35m-55m</td>\n<td>🚧</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Cogullada---Campus-%28Carretera-Cogullada%29.gpx\">Cogullada - Campus (Carretera Cogullada)</a></td>\n<td>9,95 km</td>\n<td>30m-45m</td>\n<td>Poco tráfico. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28por-margen-der.-G%C3%A1llego%29.gpx\">Azud - Campus (por margen der. Gállego)</a></td>\n<td>13,00 km</td>\n<td>35m-55m</td>\n<td>La más divertida. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28margen-izq.-G%C3%A1llego%2C-asfalto%29.gpx\">Azud - Campus (margen izq. Gállego, asfalto)</a></td>\n<td>12,05 km</td>\n<td>35m-50m</td>\n<td>En mi opinión la mejor, buen equilibrio entre rapidez, pocos coches, limpieza de bici y opción a terminar del todo por asfalto.</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28margen-izq.-G%C3%A1llego%2C-caminos%29.gpx\">Azud - Campus (margen izq. Gállego, caminos)</a></td>\n<td>11,73 km</td>\n<td>35m-50m</td>\n<td>Paralela a la anterior, sin coches pero ensucia más la bicicleta. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28todo-asfalto%29.gpx\">Azud - Campus (todo asfalto)</a></td>\n<td>13,08 km</td>\n<td>35m-55m</td>\n<td>Tramo compartido con tráfico rodado desde Montañanesa hasta entrada a Camino el Saso.</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28todo-asfalto-2%29.gpx\">Azud - Campus (todo asfalto 2)</a></td>\n<td>12,12 km</td>\n<td>35m-50m</td>\n<td>Tramo compartido con tráfico rodado desde Santa Isabel hasta Montañana.</td>\n</tr>\n<tr>\n<td><a href=\"files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28todo-asfalto-3%29.gpx\">Azud - Campus (todo asfalto 3)</a></td>\n<td>13,02 km</td>\n<td>35m-55m</td>\n<td>Sólo discurre por la carretera de Montañana un pequeño tramo con arcén.</td>\n</tr>\n</tbody>\n</table>\n<p>El emoji 🚧 en las observaciones de algunas de las rutas de la tabla significa que hay que hacer el paso por el acueducto sobre la acequia de Urdán. Se trata del acueducto de la foto. Puede ser un poco complicado de pasar junto a la bici, sobre todo cuando transporta agua o está mojado, ya que se vuelve resbaladizo y es estrecho. En caso de no verlo claro, se puede pasar al otro lado de la acequia por un paso a nivel que hay más adelante a unos 400m.</p>\n<p><img alt=\"Acueducto sobre acequia de Urdán\" src=\"images/posts/2024-05-31_campus_aula_dei_en_bici/acueducto_acequia_urdan.jpg\" /></p>\n<iframe width=\"100%\" height=\"300px\" frameborder=\"0\" allowfullscreen allow=\"geolocation\" src=\"https://umap.openstreetmap.fr/es/map/vias-zaragoza-campus-en-bicicleta_1071113?scaleControl=false&miniMap=false&scrollWheelZoom=false&zoomControl=true&editMode=disabled&moreControl=true&searchControl=null&tilelayersControl=null&embedControl=null&datalayersControl=true&onLoadPanel=none&captionBar=false&captionMenus=true\"></iframe>\n<p><a href=\"https://umap.openstreetmap.fr/es/map/vias-zaragoza-campus-en-bicicleta_1071113?scaleControl=false&miniMap=false&scrollWheelZoom=true&zoomControl=true&editMode=disabled&moreControl=true&searchControl=null&tilelayersControl=null&embedControl=null&datalayersControl=true&onLoadPanel=none&captionBar=false&captionMenus=true\">Ver a pantalla completa</a></p>", "image": "https://apuntes.eduardofilo.es/images/posts/2024-05-31_campus_aula_dei_en_bici/peloton.jpg", "date_published": "2024-05-31T08:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/en/2024-05-31_campus_aula_dei_en_bici.html", "url": "https://apuntes.eduardofilo.es/en/2024-05-31_campus_aula_dei_en_bici.html", "title": "Zaragoza - Campus routes by bike", "content_html": "<p><img alt=\"Cycling peloton\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/peloton.jpg\" />\nPhoto by Javier Rodrigo</p>\n<div class=\"admonition warning\">\n<p class=\"admonition-title\">Right margin route closed</p>\n<p>The path that runs along the right bank of the Gállego River (the route named \"Azud - Campus (right bank of Gállego)\" in the final table) is blocked by landslides between waypoints 14 and 15, where it passes next to a wall enclosing a plot of land very close to the river itself, at least as of 2025-02-18. One option to bypass this point is to temporarily exit onto the Cogullada road, which runs opposite the walled plot of land.</p>\n</div>\n<p>Currently, I work at the Aula Dei Campus, about 15 km from Zaragoza. Although there are several options for getting to the campus by bus, in my particular case, the combination of routes and schedules is not favorable, so from the beginning, I chose to go by bike. After a few days of testing, I adjusted the route and equipment to make it more convenient and safe. In this post, I list the different options I have come to know and describe, in my opinion, their pros and cons.</p>\n<h2 id=\"problems-and-solutions\">Problems and solutions<a class=\"headerlink\" href=\"#problems-and-solutions\" title=\"Permanent link\">&para;</a></h2>\n<p>It should be noted from the beginning that unfortunately, access to the campus by bike is not very favorable. On one hand, there are natural barriers such as the Urdán canal and especially the Gállego river, for which there are very few crossings. If we don't consider the road bridges, there are only the pedestrian walkways of <a href=\"https://osm.org/go/b_84LYjOF-?m=\">Santa Isabel</a> and the one <a href=\"https://osm.org/go/b_85hJ7oE-?m=\">near San Juan de Mozarrifar</a>, as indicated on the following map. The photo below the map is of the second walkway.</p>\n<p><img alt=\"Gállego walkways\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/pasarelas_gallego.png\" /></p>\n<p><img alt=\"San Juan de Mozarrifar pedestrian walkway\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/paso_peatonal_san_juan.jpg\" /></p>\n<p>On the other hand, the access road to the campus (A-123) lacks a shoulder for most of its route, has a speed limit of 70 km/h, many entry and exit points, and considerable traffic from tractors, trucks, and buses (especially at the start and end of the workday), which makes it unsuitable for cyclists in my opinion. However, avoiding the roads brings some drawbacks that we are going to analyze.</p>\n<h4 id=\"bike-dirt-accumulation\">Bike dirt accumulation<a class=\"headerlink\" href=\"#bike-dirt-accumulation\" title=\"Permanent link\">&para;</a></h4>\n<p>The paths are very dusty in summer and become muddy with puddles in winter. Both situations dirty the bike, especially the dust in summer, which affects the transmission (chain, chainrings, and cogs), hubs and pedal axle. For mud and puddles, the best solution is to have fenders on the bike, although in my particular case, I cannot (nor do I want to) install them.</p>\n<p>Considering both problems, I have still chosen to use the rural paths and clean the bike as often as needed. However, there are certain times, after several days of rain for example, when it’s useful to have an asphalt alternative. For this situation, and in my particular case, I use the road that connects San Gregorio with San Juan de Mozarrifar, which ends at the Cogullada road, another good alternative if accessing from an area northwest of Zaragoza. Both road sections have little traffic and a speed limit of 50 km/h. From the Cogullada road, you can access the <a href=\"https://osm.org/go/b_85hJ7oE-?m=\">walkway near San Juan</a> by heading towards the San Juan football field.</p>\n<p>In any case, in terms of minimizing cleaning and bike maintenance, the best route in my opinion is the one shown to me by my colleague Magí, which uses the <a href=\"https://osm.org/go/b_84LYjOF-?m=\">Santa Isabel walkway</a> to cross the Gállego river and follows asphalt up to above Montañanesa. It's called <code>Azud - Campus (left bank of Gállego, asphalt)</code> in the final route table. Shortly before reaching the Urdán canal (at <a href=\"https://osm.org/go/b_8406Z8?m=\">this point</a>), we have the options of finishing on rural paths to the left or turning right to exit in <a href=\"https://osm.org/go/b_842C5~g-?m=\">front of Montañanesa</a> onto the Montañana road, which we will follow for a short distance before taking the <a href=\"https://osm.org/go/b_842ylME-?m=\">Camino el Soaso</a> to reach the campus entirely on asphalt and on low-traffic roads. The reason I don't personally use this route is because I have to make a bit of a detour to access it and because I enjoy riding on rural paths with the mountain bike.</p>\n<p>Another route, slightly longer but entirely on asphalt and minimizing traffic on the Montañana road, is the one my colleague Ricardo showed me. From Santa Isabel, it runs entirely on roads parallel to the Montañana road. It is listed as <code>Azud - Campus (all asphalt 3)</code> in the final route table.</p>\n<p>As for cleaning the bike itself, I’ve come to the compromise of focusing exclusively on the drivetrain (chain, chainrings, and cogs). I ended up using a wax-based lubricant, which has the downside of needing to be reapplied every few days (3 or 4), but in return, the chain doesn’t accumulate the typical grime mix of grease and dust. I use the <a href=\"https://www.amazon.es/dp/B01CXILFJ6\">X-sauce</a> brand (it costs half as much in local stores as it does on Amazon).</p>\n<p>Once a month, I take the bike to a car wash. I start by cleaning the chain with a <a href=\"https://www.decathlon.es/es/p/limpiador-cadena-bicicleta/_/R-p-334700?mc=8651030\">chain cleaner tool</a>, which I fill with biodegradable degreaser (the <a href=\"https://www.amazon.es/dp/B084S7C3PX\">BLUB</a> brand, in particular, works excellently for me). After that, I remove the brake pads to prevent contamination and hose down the bike. At home, I dry it, apply <a href=\"https://www.amazon.es/dp/B00K7XZEZ6\">WD-40</a> to the derailleur joints, and lubricate the chain with the previously mentioned product.</p>\n<h4 id=\"puddles-and-mud\">Puddles and mud<a class=\"headerlink\" href=\"#puddles-and-mud\" title=\"Permanent link\">&para;</a></h4>\n<p>The issue of puddles may seem minor, but at least during the last cold season (2023/2024), from October to April, there were three difficult-to-pass areas at various points on my usual route, meaning the problem goes beyond just getting the bike dirty. One of these points is the <a href=\"https://osm.org/go/b_841ChW5?m=\">railroad bridge</a> that accesses Montañanesa as it crosses the path running along the right bank of the Gállego. Fortunately, I discovered that shortly before that point, a path branches off to the right, allowing you to pass under the bridge through <a href=\"https://osm.org/go/b_840dYW?m=\">one of its smaller arches</a> further ahead.</p>\n<p><img alt=\"Montañanesa railroad underpass\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/paso_bajo_ferrocarril_montananesa.jpg\" /></p>\n<p>Another even worse crossing, given that there is no alternative once you are there (it is between a fence and a field that is sometimes non-cyclable), is at a <a href=\"https://osm.org/go/b_84fr992?m=\">point on the path very close to the previously mentioned bridge</a>. Throughout these cold months, there were ponds whose edges remained permanently muddy due to the water displaced by passing vehicles. In the worst moments, the alternative was to take a slight detour up the Cogullada road to access the path that runs on the other side of the railway and thereby avoid the bridge.</p>\n<p><img alt=\"Ponds\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/lagunas.jpg\" /></p>\n<h4 id=\"cold-and-night\">Cold and Night<a class=\"headerlink\" href=\"#cold-and-night\" title=\"Permanent link\">&para;</a></h4>\n<p>In winter, the main enemies are cold hands and lighting. For the former, I’ve tried many models of gloves, both heated and non-heated, and it wasn’t until I purchased the latest ones that I managed to solve the problem. Unfortunately, at the time of writing this article, they are not available for sale, although this might be due to the winter season not yet starting. They are the \"HEAT CONCEPT BIKE\" model from the brand <a href=\"https://www.ekoi.es\">Ekoi</a>.</p>\n<p>As for lighting, some time ago I bought a powerful light (similar to <a href=\"https://es.aliexpress.com/item/1005007131009248.html\">this one</a>) for summer night rides. I started having problems with the battery, but from what I’ve seen, the battery format is quite standard or popular (8.4V), so I was able to easily find a <a href=\"https://es.aliexpress.com/item/32877254810.html\">replacement</a>.</p>\n<h4 id=\"increased-risk-of-punctures\">Increased risk of punctures<a class=\"headerlink\" href=\"#increased-risk-of-punctures\" title=\"Permanent link\">&para;</a></h4>\n<p>Here, I can only offer the natural recommendation to carry a pump with you, at least to be able to inflate the tire in case of a puncture until reaching your destination. In my case, I have my tires set up tubeless, which I recommend despite the inconveniences it has (it requires maintenance and it's much more cumbersome to remove the tire). Thanks to this, I have been able to forget about punctures for years (except for a couple of dramatic episodes where the tire would have been destroyed regardless of the tire type).</p>\n<h4 id=\"longer-travel-times\">Longer travel times<a class=\"headerlink\" href=\"#longer-travel-times\" title=\"Permanent link\">&para;</a></h4>\n<p>Using rural paths takes more time, partly due to the slower travel speed and partly due to detours required to connect tracks. Although, as can be seen on the final map with the routes, most are quite direct.</p>\n<h4 id=\"initial-orientation\">Initial orientation<a class=\"headerlink\" href=\"#initial-orientation\" title=\"Permanent link\">&para;</a></h4>\n<p>Related to the previous point, there's the possibility of getting lost, at least during the first few days, especially when using rural paths, as there's no signage and the paths/fields look similar. The first day I attempted to bike to the campus was a disaster. I had to improvise near the campus because the route I had pre-mapped with Google Maps led me to a blocked fence. <a href=\"https://connect.garmin.com/modern/activity/11031310117\">That day</a> I spent an extra hour circling through wild terrain between the Gállego river and the campus area, and later on, crossing some waterlogged fields that seemed like a good shortcut option 🤦.</p>\n<p><img alt=\"The death trap\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/trampa.png\" /></p>\n<p>To avoid this problem, on one hand, it's advisable to use the appropriate tool to plan the route, which is not Google Maps as my colleague Miguel taught me, but another based on <a href=\"https://www.openstreetmap.org/\">OpenStreetMap</a> like <a href=\"https://graphhopper.com/maps\">GraphHopper</a> where the campus perimeter is correctly mapped. On the other hand, it's advisable to carry a GPS device that allows us to follow the route without having to stop and check the map. In my case, I started using an old Garmin Edge 305. Now that I know all the different options by heart, I can lend it to other people who are encouraged to bike to the campus so they can learn the route. If you have a handlebar mount for a smartphone, you can also use a navigation app like <a href=\"https://play.google.com/store/apps/details?id=net.osmand\">OsmAnd</a> with preloaded tracks.</p>\n<p><img alt=\"GPS\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/gps.jpg\" /></p>\n<h2 id=\"routes\">Routes<a class=\"headerlink\" href=\"#routes\" title=\"Permanent link\">&para;</a></h2>\n<p>Below is the collection of routes I have selected. One of the objectives of the selection has been to cover different starting points scattered throughout the northeast of Zaragoza. Another objective is to have options that run entirely on asphalt, either for days when the paths are muddy or for people who only have road bikes. The estimated time shown in the table is an approximation that may vary depending on physical fitness, bike type, and weather conditions (hello Zaragoza wind!). The observations column indicates any problematic points or factors to consider on each route. Finally, the first column contains a link to download the GPX tracks so they can be installed in applications such as the mentioned <a href=\"https://play.google.com/store/apps/details?id=net.osmand\">OsmAnd</a>.</p>\n<table>\n<thead>\n<tr>\n<th>Route</th>\n<th>Distance</th>\n<th>Estimated time</th>\n<th>Observations</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Juslibol-Actur---Campus-%28por-San-Gregorio%29.gpx\">Juslibol/Actur - Campus (by San Gregorio)</a></td>\n<td>14,38 km</td>\n<td>40m-1h</td>\n<td>You have to cross the Huesca road, but it can be done via an overpass. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Arrabal-Picarral---Campus-%28por-Corbera-Alta%29.gpx\">Arrabal/Picarral - Campus (by Corbera Alta)</a></td>\n<td>13,05 km</td>\n<td>35m-55m</td>\n<td>🚧</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Cogullada---Campus-%28Carretera-Cogullada%29.gpx\">Cogullada - Campus (Cogullada road)</a></td>\n<td>9,95 km</td>\n<td>30m-45m</td>\n<td>Low traffic. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28por-margen-der.-G%C3%A1llego%29.gpx\">Azud - Campus (right bank of Gállego)</a></td>\n<td>13,00 km</td>\n<td>35m-55m</td>\n<td>The most fun. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28margen-izq.-G%C3%A1llego%2C-asfalto%29.gpx\">Azud - Campus (left bank of Gállego, asphalt)</a></td>\n<td>12,05 km</td>\n<td>35m-50m</td>\n<td>In my opinion the best option, offers a good balance between speed, few cars, bike cleanliness, and the possibility to finish entirely on asphalt.</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28margen-izq.-G%C3%A1llego%2C-caminos%29.gpx\">Azud - Campus (left bank of Gállego, rural paths)</a></td>\n<td>11,73 km</td>\n<td>35m-50m</td>\n<td>Parallel to the previous one, without cars but it dirties the bike more. 🚧</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28todo-asfalto%29.gpx\">Azud - Campus (all asphalt)</a></td>\n<td>13,08 km</td>\n<td>35m-55m</td>\n<td>It has a section shared with road traffic from Montañanesa to the entrance of Camino el Saso.</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28todo-asfalto-2%29.gpx\">Azud - Campus (all asphalt 2)</a></td>\n<td>12,12 km</td>\n<td>35m-50m</td>\n<td>It has a section shared with road traffic from Santa Isabel to Montañana.</td>\n</tr>\n<tr>\n<td><a href=\"../files/posts/2024-05-31_campus_aula_dei_en_bici/Azud---Campus-%28todo-asfalto-3%29.gpx\">Azud - Campus (all asphalt 3)</a></td>\n<td>13,02 km</td>\n<td>35m-55m</td>\n<td>There is only a small section along the Montañana road but have  a shoulder.</td>\n</tr>\n</tbody>\n</table>\n<p>The emoji 🚧 in the observations of some routes in the table means that you have to cross the aqueduct over the Urdán canal. This is the aqueduct in the photo. It can be a bit tricky to pass with the bike, especially when it's carrying water or wet, as it becomes slippery and it is narrow. If it's not clear, you can cross to the other side of the canal via a level crossing further ahead, about 400m away.</p>\n<p><img alt=\"Aqueduct over the Urdán canal\" src=\"../images/posts/2024-05-31_campus_aula_dei_en_bici/acueducto_acequia_urdan.jpg\" /></p>\n<iframe width=\"100%\" height=\"300px\" frameborder=\"0\" allowfullscreen allow=\"geolocation\" src=\"https://umap.openstreetmap.fr/es/map/vias-zaragoza-campus-en-bicicleta_1071113?scaleControl=false&miniMap=false&scrollWheelZoom=false&zoomControl=true&editMode=disabled&moreControl=true&searchControl=null&tilelayersControl=null&embedControl=null&datalayersControl=true&onLoadPanel=none&captionBar=false&captionMenus=true\"></iframe>\n<p><a href=\"https://umap.openstreetmap.fr/es/map/vias-zaragoza-campus-en-bicicleta_1071113?scaleControl=false&miniMap=false&scrollWheelZoom=true&zoomControl=true&editMode=disabled&moreControl=true&searchControl=null&tilelayersControl=null&embedControl=null&datalayersControl=true&onLoadPanel=none&captionBar=false&captionMenus=true\">Full screen view</a></p>", "image": "https://apuntes.eduardofilo.es/images/posts/2024-05-31_campus_aula_dei_en_bici/peloton.jpg", "date_published": "2024-05-31T08:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/2022-10-05_entrevista_podcast_linux.html", "url": "https://apuntes.eduardofilo.es/2022-10-05_entrevista_podcast_linux.html", "title": "Entrevista en Podcast Linux", "content_html": "<p><img alt=\"Podcast Linux\" src=\"images/posts/2022-10-05_entrevista_podcast_linux/logo-plano.png\" /></p>\n<p>Hace unas semanas Juan Febles, responsable de <a href=\"https://podcastlinux.com/\">Podcast Linux</a>, tuvo la gentileza de invitarme para charlar con él en su programa. Fundamentalmente hablamos sobre la imagen Adán para consolas portátiles de retro-emulación. Charlamos también de mis comienzos y recorrido con Linux y el software libre, un sistema operativo y filosofía que nos apasionan tanto a Juan como a mi.</p>\n<p>Desde aquí agradecer de nuevo a Juan por haberse fijado en el proyecto Adán y considerarlo como contenido interesante para su podcast, que por cierto te animo a seguir si su temática está entre tus intereses.</p>\n<p>Si te apetece escuchar la conversación puedes hacerlo desde aquí mismo:</p>\n<p><audio controls=\"\">\n  <source src=\"https://archive.org/download/podcast_linux/PL166.ogg\" type=\"audio/ogg\">\n  <source src=\"https://archive.org/download/podcast_linux/PL166.mp3\" type=\"audio/mpeg\">\n</audio></p>\n<p>El enlace a la entrevista en la web del podcast es <a href=\"https://podcastlinux.com/posts/podcastlinux/166-Podcast-Linux/\">éste</a>.</p>\n<p>Por último indico algunas direcciones de contacto del podcast de Juan:</p>\n<ul>\n<li><a href=\"https://podcastlinux.com/\">Web</a></li>\n<li><a href=\"https://www.ivoox.com/podcast-podcast-linux_sq_f1297890_1.html\">iVoox</a></li>\n<li><a href=\"https://t.me/podcastlinux\">Telegram</a></li>\n<li><a href=\"https://twitter.com/podcastlinux\">Twitter</a></li>\n</ul>", "image": "https://apuntes.eduardofilo.es/images/posts/2022-10-05_entrevista_podcast_linux/logo-plano.png", "date_published": "2022-10-05T07:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/en/2022-10-05_entrevista_podcast_linux.html", "url": "https://apuntes.eduardofilo.es/en/2022-10-05_entrevista_podcast_linux.html", "title": "Podcast Linux Interview", "content_html": "<p><img alt=\"Podcast Linux\" src=\"../images/posts/2022-10-05_entrevista_podcast_linux/logo-plano.png\" /></p>\n<p>A few weeks ago Juan Febles, creator of <a href=\"https://podcastlinux.com/\">Podcast Linux</a>, was kind enough to invite me to chat with him on his show. We mainly talked about the Adam image for portable retro-emulation consoles. We also talked about my beginnings and journey with Linux and free software, an operating system and philosophy that both Juan and I are passionate about.</p>\n<p>I would like to thank Juan again for having noticed the Adam project and considering it as interesting content for his podcast, which by the way I encourage you to follow if its subject matter is among your interests.</p>\n<p>If you would like to listen to the conversation (in spanish) you can do so right here:</p>\n<p><audio controls=\"\">\n  <source src=\"https://archive.org/download/podcast_linux/PL166.ogg\" type=\"audio/ogg\">\n  <source src=\"https://archive.org/download/podcast_linux/PL166.mp3\" type=\"audio/mpeg\">\n</audio></p>\n<p>The link to the interview on the podcast site is <a href=\"https://podcastlinux.com/posts/podcastlinux/166-Podcast-Linux/\">this one</a>.</p>\n<p>Finally, here are some addresses to find Juan's podcast:</p>\n<ul>\n<li><a href=\"https://podcastlinux.com/\">Web</a></li>\n<li><a href=\"https://www.ivoox.com/podcast-podcast-linux_sq_f1297890_1.html\">iVoox</a></li>\n<li><a href=\"https://t.me/podcastlinux\">Telegram</a></li>\n<li><a href=\"https://twitter.com/podcastlinux\">Twitter</a></li>\n</ul>", "image": "https://apuntes.eduardofilo.es/images/posts/2022-10-05_entrevista_podcast_linux/logo-plano.png", "date_published": "2022-10-05T07:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/2022-08-08_mmiyoo_uart.html", "url": "https://apuntes.eduardofilo.es/2022-08-08_mmiyoo_uart.html", "title": "Miyoo Mini UART", "content_html": "<p><img alt=\"Miyoo Mini UART\" src=\"images/posts/2022-08-08_mmiyoo_uart/mmiyoo_uart.jpg\" /></p>\n<p>En este artículo vamos a ver una modificación de la retroconsola de emulación Miyoo Mini para extraer el puerto UART que existe en la PCB y así poder tener acceso a él sin abrir la carcasa. Dicho puerto UART además está conectado con una terminal del sistema, lo que nos ayudará mucho durante el desarrollo o la personalización del sistema de la consola.</p>\n<p>Antes de empezar con el procedimiento, comentar que la modificación no es sencilla. Al ser una máquina tan pequeña, hay poco espacio para pasar cables o situar el conector exterior.</p>\n<h2 id=\"procedimiento\">Procedimiento<a class=\"headerlink\" href=\"#procedimiento\" title=\"Permanent link\">&para;</a></h2>\n<ol>\n<li>\n<p>Abrimos la consola. Encontraremos los pads del puerto UART bajo la salida de la cinta de datos de la pantalla.</p>\n<p><img alt=\"Miyoo Mini abierta\" src=\"images/posts/2022-08-08_mmiyoo_uart/consola_abierta.jpg\" /></p>\n</li>\n<li>\n<p>Buscamos un sitio donde poder colocar algún tipo de puerto con 3 ó 4 pines. Realmente con 3 es suficiente, pero ya que estamos haciendo la modificación, intentaremos rutear los 4 pines del puerto completo. Encontramos que hay un espacio (en la v2 de la Miyoo Mini) en el compartimento de la batería donde se puede colocar medio zócalo de 2x4 cortado por la mitad de manera que quede una tira de 4 pines hembra. Las tiras de pin hembra tradicionales son demasiado altas por lo que no se podría cerrar la tapa de la batería. Aquí vemos el zócalo antes y después de partirlo por la mitad (realmente en la foto de la izquierda ya estaba cortado, pero he apoyado las dos mitades para que se entienda de dónde ha salido la pieza).</p>\n<p><img alt=\"Zócalo cortado\" src=\"images/posts/2022-08-08_mmiyoo_uart/zocalo_2x4.jpg\" /></p>\n</li>\n<li>\n<p>La mini tira de pin hembra que hemos fabricado encaja perfectamente en la posición que se muestra en la foto.</p>\n<p><img alt=\"Ubicación zócalo\" src=\"images/posts/2022-08-08_mmiyoo_uart/ubicacion_zocalo.jpg\" /></p>\n</li>\n<li>\n<p>Pegamos la mini tira de pin con resina epoxi.</p>\n<p><img alt=\"Mini tira de pin pegada\" src=\"images/posts/2022-08-08_mmiyoo_uart/pegado.jpg\" /></p>\n</li>\n<li>\n<p>Por el lado interior de la carcasa tenemos que doblar los pines del zócalo para que no colisionen con la PCB (como comentábamos al principio, el interior de la consola está muy bien aprovechado).</p>\n<p><img alt=\"Pines doblados\" src=\"images/posts/2022-08-08_mmiyoo_uart/pines_doblados.jpg\" /></p>\n</li>\n<li>\n<p>Comienza la fase más complicada del proceso. Como hemos comentado ya, hay muy poco espacio libre en el interior de la consola. Por ejemplo la carcasa a la que acabamos de pegar el mini zócalo está completamente apoyada en la PCB en toda la superficie del hueco donde se aloja la batería. Vamos pues a rutear las conexiones rodeando este hueco. Aún así el espacio es reducido, por lo que optamos por utilizar cables barnizados en lugar de hilos con envoltura PVC tradicional. El cable barnizado además al ser de un sólo hilo, nos ayudará a enrutarlo, ya que una vez deformado, conserva su forma. Buscamos el cable barnizado por ejemplo en un viejo alimentador de portátil estropeado. Es seguro que al menos contendrá cable barnizado en el transformador, pero al abrirlo encontramos los tres bobinados que señalamos en la foto (el transformador es el de la derecha).</p>\n<p><img alt=\"Bobinados alimentador estropeado\" src=\"images/posts/2022-08-08_mmiyoo_uart/alimentador_estropeado.jpg\" /></p>\n</li>\n<li>\n<p>Finalmente escogemos la bobina que tiene un espesor de cable intermedio (no desmonté el transformador, pero seguro que habría tenido el cable más fino). De ella extraemos 4 fragmentos de unos 12cm. Hay que recordar que al ser cable barnizado, habrá que rascar o disolver de alguna forma el barniz en los extremos para que podamos soldar. El raspado se puede hacer con una cuchilla o con papel de lija.</p>\n<p><img alt=\"Cables extraidos\" src=\"images/posts/2022-08-08_mmiyoo_uart/cables_extraidos.jpg\" /></p>\n</li>\n<li>\n<p>Comienza ahora sí la parte más laboriosa. Empezamos soldando los cuatro cables a los pines del zócalo. Curvamos los cables con la forma de los pines doblados del zócalo para que haya más superficie de contacto para la soldadura. En la foto no aparece porque se instaló al final, pero es muy conveniente cubrir las soldaduras con cinta aislante o mejor cinta Kapton (que es más fina), para evitar que éstas arañen la PCB y terminen provocando un puente. Es más sencillo colocar la cinta sobre la PCB, pero en ese caso tendremos que estimar a ojo la zona a cubrir, aunque no hay problema en poner más cinta de la cuenta para asegurar la operación.</p>\n<p><img alt=\"Soldadura cables a zócalo\" src=\"images/posts/2022-08-08_mmiyoo_uart/soldadura_zocalo.jpg\" /></p>\n</li>\n<li>\n<p>Ahora sí, con paciencia vamos enrutando los cables, dando forma con unas pinzas o alicates finos y fijándolos de vez en cuando con cola caliente por ejemplo.</p>\n<p><img alt=\"Enrutando cables\" src=\"images/posts/2022-08-08_mmiyoo_uart/enrutando.jpg\" /></p>\n</li>\n<li>\n<p>Cuando nos acerquemos a la posición final de los cables, los cortaremos escalonadamente (averiguando cual es cual respecto de las soldaduras del zócalo con el polímetro en modo continuidad). También haremos un pequeño doblez que será el que introduciremos en los pads del puerto en la PCB. Hay que recordar que de nuevo tendremos que retirar el barniz de este extremo de los cables, lo que haremos preferentemente antes de hacer el doblez.</p>\n<p><img alt=\"Recortando cables\" src=\"images/posts/2022-08-08_mmiyoo_uart/recortando.jpg\" /></p>\n</li>\n<li>\n<p>Sólo resta hacer las soldaduras en la PCB.</p>\n<p><img alt=\"Soldadura cables a PCB\" src=\"images/posts/2022-08-08_mmiyoo_uart/soldadura_pcb.jpg\" /></p>\n</li>\n<li>\n<p>Ya podemos cerrar la consola. Hay que vigilar los cables que discurren cerca del labio que hay entre las dos mitades de la carcasa para evitar que pillemos alguno de ellos. Ya tenemos nuestro puerto UART a la vista.</p>\n<p><img alt=\"Resultado final\" src=\"images/posts/2022-08-08_mmiyoo_uart/fin.jpg\" /></p>\n</li>\n</ol>\n<h2 id=\"conexion\">Conexión<a class=\"headerlink\" href=\"#conexion\" title=\"Permanent link\">&para;</a></h2>\n<p>Para conectar al puerto UART recien expuesto, utilizamos el típico adaptador UART-USB. En mi caso utilizo <a href=\"https://www.amazon.es/dp/B07BBPX8B8\">éste</a> que tiene bastantes posibilidades. Como cliente utilizo <code>screen</code> lanzado de la siguiente forma ya que la velocidad del puerto es 115200bps:</p>\n<div class=\"highlight\"><pre><span></span><code>sudo<span class=\"w\"> </span>screen<span class=\"w\"> </span>/dev/ttyUSB0<span class=\"w\"> </span><span class=\"m\">115200</span><span class=\"w\"> </span>8N1\n</code></pre></div>\n<p>Sólo utilizaremos los pines GND, RX y TX, cruzando los dos últimos con los del adaptador UART-USB, es decir cableando el RX de la consola al TX del adaptador y viceversa. Aunque no utilizamos la línea de alimentación (2.8V en esta consola), configuraremos el adaptador UART-USB a 3.3V para que los niveles de señal que viajan por RX/TX sean lo más parecidos posible.</p>\n<p>Un ejemplo:</p>\n<iframe width=\"806\" height=\"453\" src=\"https://www.youtube.com/embed/Df2k8gsOvtM\" title=\"Miyoo Mini UART session\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "image": "https://apuntes.eduardofilo.es/images/posts/2022-08-08_mmiyoo_uart/mmiyoo_uart.jpg", "date_published": "2022-08-08T17:00:00+02:00", "authors": [], "tags": null}, {"id": "https://apuntes.eduardofilo.es/en/2022-08-08_mmiyoo_uart.html", "url": "https://apuntes.eduardofilo.es/en/2022-08-08_mmiyoo_uart.html", "title": "Miyoo Mini UART", "content_html": "<p><img alt=\"Miyoo Mini UART\" src=\"../images/posts/2022-08-08_mmiyoo_uart/mmiyoo_uart.jpg\" /></p>\n<p>In this article we are going to see a modification of the Miyoo Mini emulation retro console to extract the UART port that exists on the PCB and thus be able to access it without opening the case. This UART port is also connected to a system terminal, which will help us a lot during the development or customization of the console system.</p>\n<p>Before starting with the procedure, it should be noted that the modification is not simple. Being such a small machine, there is little space to pass cables or place the external connector.</p>\n<h2 id=\"procedure\">Procedure<a class=\"headerlink\" href=\"#procedure\" title=\"Permanent link\">&para;</a></h2>\n<ol>\n<li>\n<p>We open the console. We will find the UART port pads under the screen flex cable.</p>\n<p><img alt=\"Opened Miyoo Mini\" src=\"../images/posts/2022-08-08_mmiyoo_uart/consola_abierta.jpg\" /></p>\n</li>\n<li>\n<p>We are looking for a place where we can put some kind of connector with 3 or 4 pins. Actually 3 is enough, but since we are doing the modification, we will try to route the 4 pins of the full port. We found that there is a space (in Miyoo Mini v2) in the battery compartment where you can place half a 2x4 socket resulting a mini female 4 pin socket. Traditional female pin sockets are too tall so you would not be able to close the battery cover. Here we see the socket before and after cutting it in half (actually in the left picture it was already cut, but I have supported the two halves so you can see where the piece came from).</p>\n<p><img alt=\"Sliced socket\" src=\"../images/posts/2022-08-08_mmiyoo_uart/zocalo_2x4.jpg\" /></p>\n</li>\n<li>\n<p>The mini female pin socket we have manufactured fits perfectly in the position shown in the picture.</p>\n<p><img alt=\"Socket placement\" src=\"../images/posts/2022-08-08_mmiyoo_uart/ubicacion_zocalo.jpg\" /></p>\n</li>\n<li>\n<p>We glue the mini pin socket with epoxy resin.</p>\n<p><img alt=\"Mini socket glued\" src=\"../images/posts/2022-08-08_mmiyoo_uart/pegado.jpg\" /></p>\n</li>\n<li>\n<p>On the inside of the case we have to bend the socket pins so that they do not collide with the PCB (as we mentioned at the beginning, the inside of the device is very well used).</p>\n<p><img alt=\"Bended pins\" src=\"../images/posts/2022-08-08_mmiyoo_uart/pines_doblados.jpg\" /></p>\n</li>\n<li>\n<p>The most complicated phase of the process begins. As we have already mentioned, there is very little free space inside the device. For example, the case to which we have just glued the mini socket is completely supported on the PCB along the entire surface of the hole where the battery is housed. We are going to route the connections around this hole. Even so the space is limited, so we chose to use varnished cables instead of wires with traditional PVC insulation. The varnished cable is also a single wire, which will help us to route it, since once deformed, it retains its shape. We look for the varnished cable for example in an old broken laptop power supply. It is sure that at least it will contain varnished cable in the transformer, but when we open it we find the three coils that we point out in the picture (the transformer is the one on the right).</p>\n<p><img alt=\"Broken power supply coils\" src=\"../images/posts/2022-08-08_mmiyoo_uart/alimentador_estropeado.jpg\" /></p>\n</li>\n<li>\n<p>Finally we choose the coil that has an intermediate wire thickness (I didn't disassemble the transformer, but I'm sure it would have had thinner wire). From it we extract 4 fragments of about 12cm. It is necessary to remember that being varnished cable, it will be necessary to scrape or to dissolve somehow the varnish in the ends so that we can solder. The scraping can be done with a blade or with sandpaper.</p>\n<p><img alt=\"Obtained cables\" src=\"../images/posts/2022-08-08_mmiyoo_uart/cables_extraidos.jpg\" /></p>\n</li>\n<li>\n<p>Now begins the most laborious part. We start by soldering the four wires to the socket pins. We bend the wires with the form of the bent pins of the socket so that there is more contact surface for the soldering. In the picture it does not appear because it was installed at the end, but it is very convenient to cover the solder joints with insulating tape or better Kapton tape (which is thinner), to prevent them from scratching the PCB and end up causing a short. It is easier to place the tape over the PCB, but in that case we will have to estimate by eye the area to cover, although there is no problem to put more tape than necessary to ensure the operation.</p>\n<p><img alt=\"Socket-cable soldering\" src=\"../images/posts/2022-08-08_mmiyoo_uart/soldadura_zocalo.jpg\" /></p>\n</li>\n<li>\n<p>Now we patiently route the wires, shaping them with tweezers or fine pliers and fixing them from time to time with hot glue for example.</p>\n<p><img alt=\"Routing cables\" src=\"../images/posts/2022-08-08_mmiyoo_uart/enrutando.jpg\" /></p>\n</li>\n<li>\n<p>When we approach the final position of the wires, we will cut them staggered (finding out which one is which with respect to the soldering of the socket with the multimeter in continuity mode). We will also make a small bend that will be the one that we will introduce in the pads of the port on the PCB. It is necessary to remember that again we will have to remove the varnish of this end of the wires, what we will do preferably before making the fold.</p>\n<p><img alt=\"Cutting cables\" src=\"../images/posts/2022-08-08_mmiyoo_uart/recortando.jpg\" /></p>\n</li>\n<li>\n<p>Now we solder the cables to the PCB.</p>\n<p><img alt=\"Cables-PCB soldering\" src=\"../images/posts/2022-08-08_mmiyoo_uart/soldadura_pcb.jpg\" /></p>\n</li>\n<li>\n<p>We can now close the console. Keep an eye on the cables that run near the lip between the two halves of the case to avoid catching any of them. Now we have our UART port in sight.</p>\n<p><img alt=\"End result\" src=\"../images/posts/2022-08-08_mmiyoo_uart/fin.jpg\" /></p>\n</li>\n</ol>\n<h2 id=\"connection\">Connection<a class=\"headerlink\" href=\"#connection\" title=\"Permanent link\">&para;</a></h2>\n<p>To connect to the UART port just exposed, we use the typical UART-USB adapter. In my case I use <a href=\"https://www.amazon.es/dp/B07BBPX8B8\">this one</a> which has quite a lot of possibilities. As client I use <code>screen</code> in Linux launched as follows since the port speed is 115200bps:</p>\n<div class=\"highlight\"><pre><span></span><code>sudo<span class=\"w\"> </span>screen<span class=\"w\"> </span>/dev/ttyUSB0<span class=\"w\"> </span><span class=\"m\">115200</span><span class=\"w\"> </span>8N1\n</code></pre></div>\n<p>We will only use the GND, RX and TX pins, crossing the last two with those of the UART-USB adapter, that is to say wiring the RX of the device to the TX of the adapter and vice versa. Although we do not use the power supply line (2.8V in this device), we will configure the UART-USB adapter to 3.3V so that the signal levels that travel by RX/TX are as similar as possible.</p>\n<p>An example:</p>\n<iframe width=\"806\" height=\"453\" src=\"https://www.youtube.com/embed/Df2k8gsOvtM\" title=\"Miyoo Mini UART session\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "image": "https://apuntes.eduardofilo.es/images/posts/2022-08-08_mmiyoo_uart/mmiyoo_uart.jpg", "date_published": "2022-08-08T17:00:00+02:00", "authors": [], "tags": null}]}